{"department":"Engineering","courses":[{"course":"AER210H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER301H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER302H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER303H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER304H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER307H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER310H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER315H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER336H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER372H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER373H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER406H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER407H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER501H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER503H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER506H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER507H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER510H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"AER525H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"APM446H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"APM466H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"APS100H1","title":"Orientation to Engineering","description":"This course is designed to help students transition into first-year engineering studies and to develop and apply a greater understanding of the academic learning environment, the field of engineering, and how the fundamental mathematics and sciences are used in an engineering context.  Topics covered include: study skills, time management, problem solving, successful teamwork, effective communications, exam preparation, stress management and wellness, undergraduate research, extra- and co-curricular involvement, engineering disciplines and career opportunities, and applications of math and science in engineering.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":12.8,"ES":0,"ED":0,"Total":12.8}},{"course":"APS105H1","title":"Computer Fundamentals","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":52.4,"ED":0,"Total":52.4}},{"course":"APS106H1","title":"Fundamentals of Computer Programming","description":"\"An introduction to computer systems and software. Topics include the representation of information, algorithms, programming languages, operating systems and software engineering. Emphasis is on the design of algorithms and their implementation in software. Students will develop a competency in the C programming language and will be introduced to the C++ programming language. Laboratory exercises will explore the concepts of both Structure-based and Object-Oriented programming using examples drawn from mathematics and engineering applications.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":57.6,"ED":0,"Total":57.6}},{"course":"APS110H1","title":"Engineering Chemistry and Materials Science","description":"This course is structured around the principle of the structure-property relationship. This relationship refers to an understanding of the microstructure of a solid, that is, the nature of the bonds between atoms and the spatial arrangement of atoms, which permits the explanation of observed behaviour. Observed materials behaviour includes mechanical, electrical, magnetic, optical, and corrosive behaviour. Topics covered in this course include: structure of the atom, models of the atom, electronic configuration, the electromagnetic spectrum, band theory, atomic bonding, optical transparency of solids, magnetic properties, molecular bonding, hybridized orbitals, crystal systems, lattices and structures, crystallographic notation, imperfections in solids, reaction rates, activation energy, solid-state diffusion, materials thermodynamics, free energy, and phase equilibrium.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"CHM138H1","weight":"","aus":{"Math":0,"NS":38.4,"CS":0,"ES":12.8,"ED":0,"Total":51.2}},{"course":"APS111H1","title":"Engineering Strategies & Practice I","description":"\"This course introduces and provides a framework for the design process. Students are introduced to communication as an integral component of engineering practice. The course is a vehicle for understanding problem solving and developing communications skills. This first course in the two Engineering Strategies and Practice course sequence introduces students to the process of engineering design, to strategies for successful team work, and to design for human factors, society and the environment. Students write team and individual technical reports and give presentations within a discussion group.\"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":30.7,"ES":0,"ED":20.5,"Total":51.2}},{"course":"APS112H1","title":"Engineering Strategies & Practice II","description":"\"This course introduces and provides a framework for the design process, problem solving and project management. Students are introduced to communication as an integral component of engineering practice. The course is a vehicle for practicing team skills and developing communications skills. Building on the first course, this second course in the two Engineering Strategies and Practice course sequence introduces students to project management and to the design process in greater depth. Students work in teams on a term length design project. Students will write a series of technical reports and give a team based design project presentation.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":15.4,"ES":0,"ED":23,"Total":38.4}},{"course":"APS150H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"APS160H1","title":"Mechanics","description":"The principles of statics are applied to composition and resolution of forces, moments and couples. The equilibrium states of structures are examined. Throughout, the free body diagram concept is emphasized. Vector algebra is used where it is most useful, and stress blocks are introduced. Shear force diagrams, bending moment diagrams and stress-strain relationships for materials are discussed. Stress and deformation in axially loaded members and flexural members (beams) are also covered.  Not offered in 2013-2014.","session":[],"prereqs":"None","coreqs":"None","exclusions":"CIV100H1","weight":"","aus":{"Math":0,"NS":35.8,"CS":0,"ES":15.4,"ED":0,"Total":51.2}},{"course":"APS161H1","title":"Dynamics","description":"This course on Newtonian mechanics considers the interactions which influence 2-D, curvilinear motion. These interactions are described in terms of the concepts of force, work, momentum and energy. Initially the focus is on the kinematics and kinetics of particles. Then, the kinematics and kinetics of systems of particles and solid bodies are examined. Finally, simple harmonic motion is discussed. The occurrence of dynamic motion in natural systems, such as planetary motion, is emphasized. Applications to engineered systems are also introduced.  Not offered in 2013-2014.","session":[],"prereqs":"None","coreqs":"None","exclusions":"MIE100H1","weight":"","aus":{"Math":0,"NS":35.8,"CS":0,"ES":15.4,"ED":0,"Total":51.2}},{"course":"APS162H1","title":"Calculus for Engineers I","description":"This online-only course focuses on the fundamental tools of calculus and its connections to engineering.  The topics include limits, differentiation, graphing, optimization problems, and definite and indefinite integrals.  Problems combining calculus with geometry, linear algebra, statics, and mechanics will be examined.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"MAT186H1 or MAT196H1","weight":"","aus":{"Math":44.8,"NS":0,"CS":0,"ES":0,"ED":0,"Total":44.8}},{"course":"APS163H1","title":"Calculus for Engineers II","description":"This online-only course focuses on the fundamental tools of calculus and its connections to engineering.  The topics include methods of integration, an introduction to differential equations, series and Taylor series, vector differentiation, and partial differentiation.  Problems combining calculus with geometry, linear algebra, statics, and mechanics will be examined.","session":["Fall"],"prereqs":"APS162H1/MAT186H1","coreqs":"None","exclusions":"MAT187H1/MAT197H1","weight":"","aus":{"Math":44.8,"NS":0,"CS":0,"ES":0,"ED":0,"Total":44.8}},{"course":"APS164H1","title":"Introductory Chemistry from a Materials Perspective","description":"This online course is structured around the principle of structure-property relationship. This relationship refers to an understanding of the microstructure of a solid, that is, the nature of the bonds between atoms and the spatial arrangement of atoms, which permits the explanation of observed behaviour. Observed materials behaviour includes mechanical, electrical, magnetic, optical, and corrosive behaviour. Topics covered in this course include: structure of the atom, models of the atom, electronic configuration, the electromagnetic spectrum, band theory, atomic bonding, optical transparency of solids, magnetic properties, molecular bonding, hybridized orbitals, crystal systems, lattices and structures, crystallographic notation, imperfections in solids, reaction rates, activation energy, solid-state diffusion, materials thermodynamics, free energy, and phase equilibrium.  Available Online: consult Faculty or Graduate Unit for details","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":38.4,"CS":0,"ES":12.8,"ED":0,"Total":51.2}},{"course":"APS191H1","title":"Introduction to Engineering","description":"\"This is a seminar series that will preview the core fields in Engineering. Each seminar will highlight one of the major areas of Engineering. The format will vary and may include application examples, challenges, case studies, career opportunities, etc. The purpose of the seminar series is to provide first year students with some understanding of the various options within the Faculty to enable them to make educated choices for second year. This course will be offered on a credit/no credit basis.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.15","aus":{"Math":0,"NS":0,"CS":0,"ES":12.8,"ED":0,"Total":12.8}},{"course":"APS299Y0","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"APS305H1","title":"Energy Policy","description":"\"Complimentary Studies ElectiveCore Course in the Sustainable Energy MinorIntroduction to public policy including the role and interaction of technology and regulation, policy reinforcing/feedback cycles; procedures for legislation and policy setting at the municipal, provincial and federal levels; dimensions of energy policy; energy planning and forecasting including demand management and conservation incentives; policy institution, analysis, implementation, evaluation and evolution; Critical analyses of case studies of energy and associated environmental policies with respect to conservation and demand management for various utilities and sectors; policy derivatives for varied economic and social settings, developing countries and associated impacts.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"ENV350H1","weight":"0.5","aus":{"Math":0,"NS":0,"CS":44.8,"ES":0,"ED":0,"Total":44.8}},{"course":"APS360H1","title":"Artificial Intelligence Fundamentals","description":"A basic introduction to the history, technology, programming and applications of artificial intelligence, with emphasis on fast evolving field of machine learning.  Topics to be covered may include linear regression, logistic regression, support vector machines, and neural networks.  An applied approach will be taken, where students get hands-on exposure to AI techniques through the use of state-of-the-art machine learning software frameworks.","session":["Fall","Winter"],"prereqs":"CHE223H1 or CME263H1 or ECE302H1 or ECE286H1 or MIE231H1 or MIE236H1 or MSE238H1 or STA286H1","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":33.6,"ED":11.2,"Total":44.8}},{"course":"APS420H1","title":"Technology, Engineering and Global Development","description":"The role of technology and engineering in global development is explored through a combination of lectures, readings, case studies, and analysis of key technologies, including energy, information and communications technologies, water and healthcare. Topics include a brief history and basic theories of international development and foreign aid, major government and non-government players, emerging alternative models (social entrepreneurship, microfinance, risk capital approaches), major and emerging players in social venture capital and philanthropy, the role of financial markets, environmental and resource considerations/sustainable development, technology diffusion models and appropriate technologies. Exclusion: APS520H1","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"APS520H1","weight":"","aus":{"Math":0,"NS":0,"CS":38.4,"ES":0,"ED":0,"Total":38.4}},{"course":"APS440H1","title":"Making Sense of Accidents","description":"Despite the best of engineering practices, spectacular failures of complex technological systems occur regularly. Traditional engineering explanations for the causes of accidents utilize eventchain models and often blame operators. This course highlights the limitations of such models and shows that accidents in sociotechnical systems can be better understood using systems engineering. Further insights are provided by reviewing various sociological theories that have been advanced to explain and prevent accidents.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":44.8,"ES":0,"ED":0,"Total":44.8}},{"course":"APS490Y1","title":"Multi-Disciplinary Capstone Design","description":"An experience in multi-disciplinary engineering practice through a significant, open-ended, client-driven design project in which student teams address stakeholder needs through the use of a creative and interactive design process.   Prerequisite:  Permission of student's home department.   Exclusion:  ECE496Y1","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"ECE496Y1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":0,"ED":102.9,"Total":102.9}},{"course":"APS500H1","title":"Negotiations in an Engineering Context","description":"Instruction of concepts, theories, and research but most importantly the practice of negotiation skills. The course will cover all kinds of negotiations scenarios that individuals might face in the course of their careers as Engineers; this could include a range of single-issue single-party negotiations to multi-party multi-issues negotiations.  Recommended preparation:  JRE420H1","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":38.4,"ES":0,"ED":0,"Total":38.4}},{"course":"APS502H1","title":"Financial Engineering (free elective only)","description":"This course will focus on capital budgeting, financial optimization, and project evaluation models and their solution techniques. In particular, linear, non-linear, and integer programming models and their solutions techniques will be studied. The course will give engineering students a background in modern capital budgeting and financial techniques that are relevant in practival engineering and commercial settings. Prerequisites - MAT186/96/94 and MAT187/97/95 and MAT188/85 and (MIE236H1,MIE237H1) or ECE302  Exclusion: MIE375H1","session":["Fall","Winter"],"prereqs":"ECE302H1","coreqs":"None","exclusions":"MIE375H1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":9.6,"ED":9.6,"Total":19.2}},{"course":"APS510H1","title":"Innovative Technologies and Organizations in Global Energy Systems","description":"\"A broad range of global energy systems are presented including electricity generation, electricity end use, transportation and infrastructure.  Discussions are based on two key trends: (a) the increasing ability to deploy technologies and engineering systems globally, and (b) innovative organizations, many driven by entrepreneurship (for profit and social) and entrepreneurial finance techniques. The course considers these types of innovations in the context of developed economies, rapidly developing economies such as India and China, and the developing world. The course will interweave a mix of industry examples and more in-depth case studies.  The examples and cases are examined with various engineering, business and environmental sustainability analysis perspectives.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"APS310H1","weight":"0.5","aus":{"Math":0,"NS":0,"CS":44.8,"ES":0,"ED":0,"Total":44.8}},{"course":"APS511H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"APS530H1","title":"Appropriate Technology & Design for Global Development","description":"Engineering design within the context of global society, emphasizing the needs of users in order to support appropriate, sustainable technology.  A design project will comprise the major component of the course work. The course will take the approach of \"design for X\". Students are expected to be familiar with design for functionality, safety, robustness, etc.  This course will extend the students' understanding of design methodologies to design for \"appropriateness in developing regions\".  Readings and discussions will explore the social, cultural, economic, educational, environmental and political contexts in which third world end users relate to technology. Students will then incorporate their deepened understanding of this context in their design project. The projects will be analyzed for functionality as well as appropriateness and sustainability in the third world context. Upon completion of the course, students should have a deeper appreciation of the meaning of appropriate technology in various international development sectors such as healthcare, water & sanitation, land management, energy, infrastructure, and communications in both urban and rural settings.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":9.6,"ES":0,"ED":28.8,"Total":38.4}},{"course":"BME205H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME221H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME330H1","title":"Patents in Biology and Medical Devices","description":"The emphasis of the course is on applying the logic of patents to diverse cases of products through biology and biomedical engineering.  A commercial context will be ever present the case studies.  Students will work in teams on these problems in class.  Students will learn to apply tests for obviousness, inventiveness, novelty and enablement based on the use of these tests in technology patents in the past.  Claim construction will be introduced towards the end of the course to learn how technologies can be protected in considering a patent.  There will be papers for reading in this course but no textbook.  This course is designed for senior undergraduate students (3-4 year).","session":["Winter"],"prereqs":"CHE313H1 or BME205H1","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":19.2,"ES":19.2,"ED":0,"Total":38.4}},{"course":"BME331H1","title":"Physiological Control Systems","description":"This course introduces physiological concepts and selected physiological control systems present in the human body to undergraduate students. The course is organized into four parts: (1) introduce physiology and give an overview of the main physiological systems, (2) introduce endocrine system and its subsystems, including glucose regulation, thyroid metabolic hormones, and the menstrual cycle, (3) introduce cardiovascular system and related aspects such as cardiac output, venous return, control of blood flow by the tissues, and nervous regulation of circulation, and (4) introduce central nervous system, the musculoskeletal system, proprioception, kinaesthetic, and control of voluntary motion. These topics allows us to combine linear control theory, physiology, and neuroscience with the objective of explaining how these complex systems operate in a healthy human body.","session":["Winter"],"prereqs":"CHE353H1","coreqs":"None","exclusions":"MIE331H1","weight":"","aus":{"Math":0,"NS":38.4,"CS":0,"ES":12.8,"ED":0,"Total":51.2}},{"course":"BME344H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME346H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME350H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME352H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME358H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME395H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME396H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME410H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME428H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME435H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME440H1","title":"Biomedical Engineering Technology and Investigation","description":"An introduction to the principles of fundamental technologies used in biomedical engineering research including but not limited to tissue culture, protein assays or colourimetric enzymatic-based assays, spectroscopy, fluorescence microscopy, PCR, electrophoresis, DNA manipulation and transfection. Since these technologies enable the investigation of a wide range of research questions with important clinical implications, the main focus of the course is learning these technologies while subsequent application within the lab will allow evidence-based investigation into specific research questions. Scientific literature (both good and bad) pertaining to each technology will be reviewed as examples of conducting investigations.","session":["Fall"],"prereqs":"CHE353H1","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":25.6,"ED":25.6,"Total":51.2}},{"course":"BME445H1","title":"Neural Bioelectricity (formerly ECE445H1)","description":"\"This course deals with generation, transmission and significance of bioelectricity in neural networks. Topics covered include: (i) Basic features of neural systems. (ii) Ionic transport mechanisms in neural membranes. (iii) Nonlinear circuit models of neuronal membranes. (iv) Propagation of electricity in neural cables. (v) Extracellular electric fields of cellular moving current sources. (vi) Biological neural networks. (vii) Artificial neural networks. (viii) Learning and memory in artificial neural networks. Laboratory topics include: (a) Measurement of surface potentials on human torsos. (b) Generation of cellular electricity in computer models of nonlinear circuits. (c) Propagation of bioelectricity in computer models of nonlinear neural cables. (d) Investigation of a computer model of a periform cortex network.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"ECE445H1","weight":"0.5","aus":{"Math":0,"NS":21.4,"CS":0,"ES":32,"ED":0,"Total":53.4}},{"course":"BME455H1","title":"Cellular and Molecular Bioengineering II","description":"\"Quantitative approach to understanding cellular behaviour. Using engineering tools (especially derived from transport phenomena and chemical kinetics) to integrate and enhance what is known about mammalian cell behaviour at the molecular level. The course combines mathematical modeling with biology and includes numerical methods, factorial design, statistics, empirical models, mechanistic models and mass transfer.  Specific topics include: receptor-ligand interactions, cell adhesion and migration, signal transduction, cell growth and differentiation. Examples from gene therapy, and cellular and tissue engineering are used. \"","session":["Fall"],"prereqs":"CHE353H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":13.6,"CS":0,"ES":27.2,"ED":13.6,"Total":54.4}},{"course":"BME460H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME479H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME489H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME498Y1","title":"Biomedical Engineering Capstone Design (BIOMED MINOR ONLY)","description":"2/3/-/1.00  In this project-based design course teams of students from diverse engineering disciplines (enrolled in the biomedical engineering minor) will engage in the bio-medical technology design process to identify, invent and implement a solution to a unmet clinical need. The students will learn about medical technology development and will engage in the process through lectures, guest lectures delivered by medical technology experts, \"hands-on\" practicums and a student driven design project.  Approval to register in the course must be obtained from the Associate Chair, IBBME - Undergraduate.","session":["Fall"],"prereqs":"To be eligible to register for the capstone course, you must have taken at least 7 technical electives or 6 technical electives plus ECE472H1.  NOTE: This capstone is available for those registered in the Biomedical Engineering Minor","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":0,"ED":89.6,"Total":89.6}},{"course":"BME499Y1","title":"Innovation and Applied Research & Design in Biomedical Engineering (BIOMED minor only)","description":"The goal of this course is to provide the students with some perspective with respect to the innovative work being done in the field.  Students will take 2 modules in this course (one per term), each of which exposes them to biomedical research and development activity that leads to applied knowledge in the field of biomedical engineering. Each module will include at minimum  90 hours of hands-on exposure to activity in one of IBBME's core or cross-appointed faculty members lab, and to carry out the development of a research proposal related to the topic given to the student.  The activities will expose the student to the design of experiments, the use of analytical equiment, and the relevant literature (scientific, patent and regulatory) related to the topic of research identified by the faculty member.  Approval to register in the course must be obtained from the Associate Chair, IBBME - Undergraduate and is normally restricted to students with a cumulative average of at least B in the year prior.  Prerequisite: CHE353H1 or equivalent Corequisite: MIE331H1","session":[],"prereqs":"CHE353H1","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":44.8,"CS":0,"ES":22.4,"ED":22.4,"Total":89.6}},{"course":"BME520H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME530H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"BME595H1","title":"Medical Imaging","description":"\"This is a first course in medical imaging. It is designed as a final year course for engineers. It has a physical and mathematical approach emphasizing engineering concepts and design. It describes magnetic resonance and ultrasound and X ray imaging in detail. These topics allow engineers to apply principles learned in the first two years in: computer fundamentals, dynamics, calculus, basic EM theory, algebra and differential equations, signals systems. It is a depth course complementing the kernels: communication systems (modulation), fields and waves (wave propagation) and on probability and random processes (Poisson and Gaussian noise). It will introduce students to the concept of measurement as an \"inverse problem\". The laboratory will involve hands on NMR and Ultrasound measurements as well as image analysis of MRI data.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":9.4,"CS":0,"ES":28.2,"ED":0,"Total":37.6}},{"course":"CHE112H1","title":"Physical Chemistry","description":"\"A course in physical chemistry. Topics discussed include systems and their states, stoichiometry, the properties of gases, the laws of chemical thermodynamics (calculations involving internal energy, enthalpy, free energy, and entropy), phase equilibrium, chemical equilibrium, ionic equilibrium, acids and bases, solutions, colligative properties, electrochemistry, and corrosion.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":51.2,"CS":0,"ES":0,"ED":0,"Total":51.2}},{"course":"CHE113H1","title":"Concepts in Chemical Engineering","description":"\"Chemical engineers are employed in extremely diverse fields ranging from medicine to plastics manufacture to the financial industry. This course introduces students to the core chemical engineering competencies of process principles, transport processes, informatics, and chemical engineering science. The competencies are presented in the context of the Department of Chemical Engineering and Applied Chemistry's clustered research areas of biomolecular and biomedical engineering, bioprocess engineering, engineering informatics, environmental science and engineering, advanced inorganic molecular systems, pulp and paper, surface and interface engineering, polymers and polymer processing and sustainable energy. Laboratories will reinforce the core chemical engineering concepts.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":21.1,"CS":0,"ES":49.3,"ED":0,"Total":70.4}},{"course":"CHE191H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE204H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE205H1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE208H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE210H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE211H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE213H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE220H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE221H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE222H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE223H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE230H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE249H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE260H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE298H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE299H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE304H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE305H1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE308H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE311H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE322H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE323H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE324H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE332H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE333H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE334H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE341H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE353H1","title":"Engineering Biology","description":"\"Using a quantitative, problem solving approach, this course will introduce basic concepts in cell biology and physiology.  Various engineering modelling tools will be used to investigate aspects of cell growth and metabolism, transport across cell membranes, protein structure, homeostasis, nerve conduction and mechanical forces in biology. Exclusion: BME105H1\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":44.8,"CS":0,"ES":0,"ED":0,"Total":44.8}},{"course":"CHE354H1","title":"Cellular and Molecular Biology","description":"\"This course will cover the principles of molecular and cellular biology as they apply to both  prokaryotic and eukaryotic cells.  Topics will include: metabolic conversion of carbohydrates, proteins, and lipids; nucleic acids; enzymology; structure and function relationships within cells;  and motility and growth.  Genetic analysis, immunohistochemistry, hybridomis, cloning, recombinant DNA and biotechnology will also be covered.  This course will appeal to students interested in environmental microbiology, biomaterials and tissue engineering, and bioprocesses. Prerequisite: CHE353H1F\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"CHE353H1","weight":"0.5","aus":{"Math":0,"NS":38.4,"CS":0,"ES":12.8,"ED":0,"Total":51.2}},{"course":"CHE374H1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE375H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE391H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE399H1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE403H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE412H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE416H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE430Y1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE441H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE450H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE451H1","title":"Petroleum Processing","description":"\"This course is aimed at surveying the oil industry practices from the perspective of a block flow diagram.  Oil refineries today involve the large scale processing of fluids through primary separation techniques, secondary treating plus the introduction of catalyst for molecular reforming in order to meet the product demands of industry and the public.  Crude oil is being shipped in increasing quantities from many parts of the world and refiners must be aware of the properties and specifications of both the crude and product slates to ensure that the crude is a viable source and that the product slate meets quality and quantity demands thus assuring a profitable operation.  The course content will examine refinery oil and gas operations from feed, through to products, touching on processing steps necessary to meet consumer demands.  In both course readings and written assignments, students will be asked to consider refinery operations from a broad perspective and not through detailed analysis and problem solving. \"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"CHE470H1/CHE472H1 if the topic was Petroleum Processing","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":38.4,"ED":0,"Total":38.4}},{"course":"CHE460H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE462H1","title":"Food Engineering","description":"The quantitative application of chemical engineering principles to the large-scale production of food. Food processing at the molecular and unit operation levels. The chemistry and kinetics of specific food processes.  The application of chemical engineering unit operations (distillation, extraction, drying) and food specific unit operations such as extrusion, thermal processing refrigeration/freezing.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":44.8,"ED":0,"Total":44.8}},{"course":"CHE467H1","title":"Environmental Engineering","description":"Core Course in the Environmental Engineering Minor A course which treats environmental engineering from a broad based but quantitative perspective and covers the driving forces for engineering activities as well as engineering principles. Models which are used for environmental impact, risk analysis, health impact, pollutant dispersion, and energy system analysis are covered.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":44.8,"ED":0,"Total":44.8}},{"course":"CHE469H1","title":"Fuel Cells and Electrochemical Conversion Devices","description":"The objective of this course is to provide a foundation for understanding the field of electrochemical conversion devices with particular emphasis on fuel cells. The topics will proceed from the fundamental thermodynamic in-system electodics and ionic interaction limitations to mass transfer and heat balance effects,t o the externalities such as economics and system integration challenges. Guest lecturers from the fuel cell industry will be invited to procide an industrial perspective. Participants will complete a paper and in-class presentation.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"MIE517H1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":22,"ED":22,"Total":44}},{"course":"CHE470H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE471H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE475H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE488H1","title":"Entrepreneurship and Business for Engineers","description":"\"A complete introduction to small business formation, management and wealth creation. Topics include: the nature of the Entrepreneur and the Canadian business environment; business idea search and Business Plan construction; Buying a business, franchising, taking over a family business; Market research and sources of data; Marketing strategies promotion, pricing, advertising, electronic channels and costing; The sales process and management, distribution channels and global marketing; Accounting, financing and analysis, sources of funding, and financial controls; The people dimension: management styles, recruiting and hiring, legal issues in employment and Human Resources; Legal forms of organization and business formation, taxation, intellectual property protection; the e-Business world and how businesses participate; Managing the business: location and equipping the business, suppliers and purchasing, credit, ethical dealing; Exiting the business and succession, selling out. A full Business Plan will be developed by each student and the top submissions will be entered into a Business Plan competition with significant cash prices for the winners. Examples will be drawn from real business situations including practicing entrepreneurs making presentations and class visits during the term. (Identical courses are offered: ECE488H1F, MIE488H1F, MSE488H1F and CIV488H1S.)*Complementary Studies Elective\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"APS234H1, APS432H1, ECE488H1, MIE488H1, MSE488H1, CIV488H1","weight":"0.5","aus":{"Math":0,"NS":0,"CS":51.2,"ES":0,"ED":0,"Total":51.2}},{"course":"CHE499Y1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE507H1","title":"Data-based Modelling for Prediction and Control","description":"This course will teach students how to build mathematical models of dynamic systems and how to use these models for prediction and control purposes. The course will deal primarily with a system identification approach to modelling (using observations from the system to build a model). Both continuous time and discrete time representations will be treated along with deterministic and stochastic models. This course will make extensive use of interactive learning by having students use computer based tools available in the Matlab software package (e.g. the System Identification Toolbox and the Model Predictive Control Toolbox).","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":44.8,"ED":0,"Total":44.8}},{"course":"CHE561H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE562H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE564H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE565H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CHE566H1","title":"Introduction to Nuclear Engineering","description":"A first course in nuclear engineering intended to introduce students to all aspects of this interdisciplinary field. Topics covered include nuclear technology, atomic and nuclear physics, thermonuclear fusion, nuclear fission, nuclear reactor theory, nuclear power plants, radiation protection and shielding, environment and nuclear safety, and the nuclear fuel cycle.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":13.4,"CS":0,"ES":31.4,"ED":0,"Total":44.8}},{"course":"CHE568H1","title":"Nuclear Engineering","description":"\"Fundamental and applied aspects of nuclear engineering. The structure of the nucleus; nuclear stability and radioactive decay; the interaction of radiation with matter including radiological health hazards; the interaction of neutrons including cross-sections, flux, moderation, fission, neutron diffusion and criticality. Poison buildup and their effects on criticality. Nuclear engineering of reactors, reactor accidents, and safety issues. \"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"MIE414H1","weight":"0.5","aus":{"Math":0,"NS":13.4,"CS":0,"ES":31.4,"ED":0,"Total":44.8}},{"course":"CIV100H1","title":"Mechanics","description":"\"The principles of statics are applied to composition and resolution of forces, moments and couples. The equilibrium states of structures are examined. Throughout, the free body diagram concept is emphasized. Vector algebra is used where it is most useful, and stress blocks are introduced. Shear force diagrams, bending moment diagrams and stress-strain relationships for materials are discussed. Stress and deformation in axially loaded members and flexural members (beams) are also covered.\"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":35.8,"CS":0,"ES":15.4,"ED":0,"Total":51.2}},{"course":"CIV102H1","title":"Structures and Materials - An Introduction to Engineering Design","description":"\"An introduction to the art and science of designing structures; material bodies that sustain or resist forces. Force, work, energy, stress, strain. The properties of engineering materials: strength, stiffness, ductility. Simple structural elements. Engineering beam theory. Stability of columns. The practical problems which constrain the design of structures such as bridges, towers, pressure vessels, dams, ships, aircraft, bicycles, birds, and trees are described. Design methods aimed at producing safe, functional, efficient and elegant structures are introduced.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":35.8,"ED":15.4,"Total":51.2}},{"course":"CIV185H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV191H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV201H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV209H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV214H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV220H1","title":"Urban Engineering Ecology","description":"\"Core Course in the Environmental Engineering Minor Basic concepts of ecology within the context of urban environments. Response of organisms, populations, dynamic predator-prey and competition processes, and ecosystems to human activities. Thermodynamic basis for food chains, energy flow, biodiversity and ecosystem stability. Biogeochemical cycles, habitat fragmentation and bioaccumulation. Introduction to industrial ecology and life cycle assessment principles. Urban metabolism and material flow analysis of cities. Response of receiving waters to pollution and introduction to waste water treatment. Emphasis is on identifying the environment/engineering interface and minimizing environmental impacts.\"","session":["Fall"],"prereqs":"CHE112H1 or APS104H1 or MSE160H1 or APS164H1 or APS110H1","coreqs":"None","exclusions":"EDV220H1","weight":"0.5","aus":{"Math":0,"NS":31.4,"CS":0,"ES":13.4,"ED":0,"Total":44.8}},{"course":"CIV235H1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV250H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV280H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV282H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV300H1","title":"Terrestrial Energy Systems","description":"\"Core Course in the Sustainable Energy Minor Various earth systems for energy transformation, storage and transport are explored. Geological, hydrological, biological, cosmological and oceanographic energy systems are considered in the context of the Earth as a dynamic system, including the variation of solar energy received by the planet and the redistribution of this energy through various radiative, latent and sensible heat transfer mechanisms. It considers the energy redistribution role of large scale atmospheric systems, of warm and cold ocean currents, the role of the polar regions, and the functioning of various hydrological systems. The contribution and influence of tectonic systems on the surface systems is briefly introduced, as well the important role of energy storage processes in physical and biological systems, including the accumulation of fossil fuel reserves.\"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"EDV300H1.","weight":"0.5","aus":{"Math":0,"NS":38.4,"CS":0,"ES":12.8,"ED":0,"Total":51.2}},{"course":"CIV301H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV312H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV313H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV324H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV331H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV332H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV340H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV342H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV375H1","title":"Building Science","description":"The fundamentals of the science of heat transfer, moisture diffusion, and air movement are presented. Using these fundamentals, the principles of more sustainable building enclosure design, including the design of walls and roofs are examined. Selected case studies together with laboratory investigations are used to illustrate how the required indoor temperature and moisture conditions can be maintained using more durable and more sustainable designs.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":13.3,"CS":0,"ES":26.7,"ED":13.3,"Total":53.3}},{"course":"CIV380H1","title":"Sustainable Energy Systems","description":"\"This course will provide students with knowledge of energy demand and supply from local to national scales. Topics include energy demands throughout the economy, major energy technologies, how these technologies work, how they are evaluated quantitatively, their economics and their impacts on the environment. In addition, the ever changing context in which these technologies (and emerging technologies) are being implemented will be outlined. Systems approaches including life cycle assessment, will be refined and applied to evaluate energy systems. A particular focus will be placed on analysis of energy alternatives within a carbon constrained economy.\"","session":["Winter"],"prereqs":"CIV375H1 and CIV220H1","coreqs":"CME368H1","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":44.8,"ES":0,"ED":0,"Total":44.8}},{"course":"CIV382Y1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV401H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV416H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV420H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV440H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV460H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV477H1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV488H1","title":"Entrepreneurship and Business for Engineers","description":"\"A complete introduction to small business formation, management and wealth creation. Topics include: the nature of the Entrepreneur and the Canadian business environment; business idea search and Business Plan construction; Buying a business, franchising, taking over a family business; Market research and sources of data; Marketing strategies promotion, pricing, advertising, electronic channels and costing; The sales process and management, distribution channels and global marketing; Accounting, financing and analysis, sources of funding, and financial controls; The people dimension: management styles, recruiting and hiring, legal issues in employment and Human Resources; Legal forms of organization and business formation, taxation, intellectual property protection; the e-Business world and how businesses participate; Managing the business: location and equipping the business, suppliers and purchasing, credit, ethical dealing; Exiting the business and succession, selling out. A full Business Plan will be developed by each student and the top submissions will be entered into a Business Plan competition with significant cash prices for the winners. Examples will be drawn from real business situations including practicing entrepreneurs making presentations and class visits during the term. (Identical courses are offered in other Departments: MSE488H1, MIE488H1, ECE488H1 and CHE488H1.)\"","session":[],"prereqs":"None","coreqs":"None","exclusions":"\"APS234H1, APS432H1.\"","weight":"0.5","aus":{"Math":0,"NS":0,"CS":51.2,"ES":0,"ED":0,"Total":51.2}},{"course":"CIV498H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV499H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV510H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV513H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV514H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV515H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV516H1","title":"Public Transit Operations and Planning","description":"3/-/1/0.50 This course covers a broad range of topics in urban transit operations and planning, with special emphasis on best-practice strategies of modern transit systems. The course will help students: Learn the history of transit and its relationship to urban development, emerging challenges, transit role in society, and new trends and issues; Understand and analyze the factors that affect transit performance and demand; Identify and analyze transit operational and planning problems; Identify possible solutions at the operational level (mostly short-term and line-based) and the strategic level (mostly long-term and network-based), and assess alternative solutions; Understand the relative performance of various transit modes (both conventional and new modes) and their domains of application; and gain knowledge of best-practice transit systems planning and emerging innovations.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":13.4,"ES":17.9,"ED":13.4,"Total":44.7}},{"course":"CIV517H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV518H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV519H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV521H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV523H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV531H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV536H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV541H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV549H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV550H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV575H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV576H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV577H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV578H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CIV580H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CME210H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CME259H1","title":"Technology in Society and the Biosphere I (Formerly APS301)","description":"Humanities and Social Science Elective This course teaches future engineers to look beyond their specialized domains of expertise in order to understand how technology functions within human life, society and the biosphere. By providing this context for design and decision-making, students will be enabled to do more than achieve the desired results by also preventing or significantly reducing undesired consequences. A more preventively-oriented mode of practicing engineering will be developed in four areas of application: materials and production, energy, work and cities. The emphasis within these topics will reflect the interests of the class.  Exclusion ESC203H1","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":26.9,"ES":0,"ED":17.9,"Total":44.8}},{"course":"CME261H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CME262H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CME263H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CME270H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CME321H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CME358H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CME362H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CME368H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CME499H1","title":"","description":"","session":["Winter","Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CME499Y1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CME500H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CME525H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CSC180H1","title":"Introduction to Computer Programming","description":"\"The first of two courses that introduces students to programming and computational thinking, and prepares them for additional study across a breadth of programming fields. Students will learn to use the Python programming language to design and implement computational solutions to problems drawn from their 1F courses, with specific focus on algorithms, data structures, problem decomposition, and the use of programming paradigms appropriate to the problems being solved. Specifically, this course aims to have students work with and understand profiling and runtime analysis, searching and sorting algorithms, and the use of recursion.\"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":57.6,"ED":0,"Total":57.6}},{"course":"CSC326H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"CSC343H1","title":"Introduction to Databases","description":"\"Introduction to database management systems. The relational data model. Relational algebra. Querying and updating databases: the query language SQL. Application programming with SQL. Integrity constraints, normal forms, and database design. Elements of database system technology: query processing, transaction management.\"","session":["Fall","Winter"],"prereqs":"(APS062H1 or MAT186H1 or MAT196H1 or MAT194H1 or ESC194H1) and (MAT187H1 or MAT197H1 or MAT195H1 or ESC195H1 or APS163H1) and (ECE345H1)","coreqs":"None","exclusions":"CSC434H1","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":34,"ED":0,"Total":34}},{"course":"CSC384H1","title":"Introduction to Artificial Intelligence","description":"\"Theories and algorithms that capture (or approximate) some of the core elements of computational intelligence. Topics include: search; logical representations and reasoning, classical automated planning, representing and reasoning with uncertainty, learning, decision making (planning) under uncertainty. Assignments provide practical experience, both theory and programming, of the core topics.\"  Recommended preparation:  CSC326H1","session":["Fall","Winter"],"prereqs":"ECE345H1 and ECE302H1","coreqs":"None","exclusions":"CSC484H1","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":32,"ED":0,"Total":32}},{"course":"CSC467H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ECE110H1","title":"Electrical Fundamentals","description":"\"A simplified overview of the physics of electricity and magnetism: Coulomb's law, Gauss' law, Ampere's law, Faraday's law. Physics of capacitors, resistors, and inductors. An introduction to circuit analysis: resistive circuits, nodal and mesh analysis, network theorems. Natural and forced response of RL and RC circuits. Sinusoidal steady-state analysis and power in AC circuits.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":28.2,"CS":0,"ES":28.2,"ED":0,"Total":56.4}},{"course":"ECE159H1","title":"Fundamentals of Electric Circuits","description":"\"DC linear circuit elements. DC linear circuit analysis; Kirchhoff's Laws, superposition, Thevenin and Norton equivalents, nodal analysis. Operational amplifier. Transient response of linear circuits. Sinusoidal steady state analysis; phasors, power in AC circuits. Frequency response; resonance phenomena.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":21.8,"CS":0,"ES":32.6,"ED":0,"Total":54.4}},{"course":"ECE191H1","title":"Introduction to Electrical and Computer Engineering","description":"This is a seminar series that will introduce first year students to the wealth of subjects within the field of Electrical and Computer Engineering. Instructors will be drawn from the various research groups within the Department. This course will be offered on a credit/no-credit basis. Credit will not be given to students who attend fewer than 70% of the seminars. Students who receive no credit for the course must re-take it in their 2F session. Students who have not received credit for this course at the end of their 2F session will not be permitted to register in session 2S.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":12.8,"ED":0,"Total":12.8}},{"course":"ECE201H1","title":"Seminar Course: Electrical and Computer Engineering","description":"This seminar introduces second year students to the various career pathways within the field of Electrical and Computer Engineering. Instructors from various areas will talk about third and fourth year ECE courses in weekly seminars to guide students with the selection of upper year courses.  The course also offers talks and advice to aid students transitioning into second year, as well as enhance students' skills such as stress management and time management.  This course will be offered on a credit/no credit basis. Credit will not be given to students who attend fewer than 70% of the seminars. Students who receive no credit for the course must re-take it in their 3F session.  Students who have not received credit for this course at the end of their 3F session will not be permitted to register for their 3S session.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":12.8,"ED":0,"Total":12.8}},{"course":"ECE212H1","title":"Circuit Analysis","description":"Nodal and loop analysis and network theorems. Natural and forced response of RL, RC, and RLC circuits. Sinusoidal steady-state analysis. Frequency response; resonance phenomena; poles and zeros; applications of the Laplace transform.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":59.4,"ED":0,"Total":59.4}},{"course":"ECE216H1","title":"Signals and Systems","description":"\"Fundamental discrete- and continuous-time signals, definition and properties of systems, linearity and time invariance, convolution, impulse response, differential and difference equations, Fourier analysis, sampling and aliasing, applications in communications.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":14.1,"NS":0,"CS":0,"ES":42.3,"ED":0,"Total":56.4}},{"course":"ECE221H1","title":"Electric and Magnetic Fields","description":"\"The fundamental laws of electromagnetics are covered, including Coulomb's law, Gauss' law, Poisson's and Laplace's equations, the Biot-Savart law, Ampere's law, Faraday's law, and Maxwell's equations. Vector calculus is applied to determine the relationship between the electric and magnetic fields and their sources (charges and currents). The interaction of the fields with material media will be discussed, including resistance, polarization in dielectrics, magnetization in magnetic materials, properties of magnetic materials and boundary conditions. Other topics include: electric and magnetic forces, the electric potential, capacitance and inductance, electric and magnetic energy, magnetic circuits, and boundary-value problems.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":42.3,"CS":0,"ES":14.1,"ED":0,"Total":56.4}},{"course":"ECE231H1","title":"Introductory Electronics","description":"\"An introduction to electronic circuits using operational amplifiers, diodes, bipolar junction transistors and field-effect transistors.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":44.6,"ED":14.9,"Total":59.5}},{"course":"ECE241H1","title":"Digital Systems","description":"\"Digital logic circuit design with substantial hands-on laboratory work. Algebraic and truth table representation of logic functions and variables. Optimizations of combinational logic, using \"don't cares.\" Multi-level logic optimization. Transistor-level design of logic gates; propagation delay and timing of gates and circuits. The Verilog hardware description language. Memory in digital circuits, including latches, clocked flip-flops, and Static Random Access Memory. Set-up and hold times of sequential logic. Finite state machines - design and implementation. Binary number representation, hardware addition and multiplication. Tri-state gates, and multiplexers. There is a major lab component using Field-Programmable Gate Arrays (FPGAs) and associated computer-aided design software.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":26.7,"ED":26.7,"Total":53.4}},{"course":"ECE243H1","title":"Computer Organization","description":"Basic computer structure. Design of central processing unit. Hardwired control. Input-output and the use of interrupts. Assembly language programming. Main memory organization and caches. Peripherals and interfacing. System design considerations. The laboratory will consist of experiments involving logic systems and microprocessors and a large open project. Design activity constitutes a major portion of laboratory work.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":37.4,"ED":16,"Total":53.4}},{"course":"ECE244H1","title":"Programming Fundamentals","description":"\"Provides a foundation in programming using an object-oriented programming language. Topics include: classes and objects, inheritance, exception handling, basic data structures (lists, tree, etc.), big-O complexity analysis, and testing and debugging. The laboratory assignments emphasize the use of object-oriented programming constructs in the design and implementation of reasonably large programs.\"","session":["Fall"],"prereqs":"APS105H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":42.3,"ED":14.1,"Total":56.4}},{"course":"ECE253H1","title":"Digital and Computer Systems","description":"\"Digital system design principles. Logic circuits, logic synthesis. Registers, arithmetic circuits, counters, finite state machines, and programmable logic devices. Verilog hardware description language.  Computer structure, machine language instruction execution and sequencing, addressing techniques. Processors, input/output techniques, and memory hierarchy. The laboratory work consists of exercises involving the design of logic circuits, and microprocessor systems. Modern computer-aided design tools and FPGA technology are used. Design aspects constitute a major portion of laboratory work.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"ECE341H1 F and ECE370H1 S","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":40.3,"ED":17.3,"Total":57.6}},{"course":"ECE259H1","title":"Electromagnetism","description":"\"The fundamental laws of electromagnetics are covered; including Coulomb's law, Gauss' law, Poisson's and Laplace's equations, the Biot-Savart's law, Ampere's law, Faraday's law, and Maxwell's equations. Vector calculus is applied to determine the relationship between the electric and magnetic fields and their sources (charges and currents). Field-matter interaction is studied, including polarization in dielectric materials and magnetization in magnetic materials. Circuit elements such as the resistor, capacitor and inductor are introduced from an electromagnetic point of view. Other topics include: electric and magnetic forces, the electric potential, capacitance and inductance, electric and magnetic energy, magnetic circuits, boundary-value problems and transmission-lines. \"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":13.4,"NS":13.4,"CS":0,"ES":17.9,"ED":0,"Total":44.7}},{"course":"ECE286H1","title":"Probability and Statistics","description":"\"A course in probability and statistics for Engineering Science students focusing on building solid probabilistic and statistical foundations. Topics include: sample space, events, definitions of probability, conditional probability, Bayes' theorem, important classes of discrete and continuous random variables and their distributions, joint, conditional, and marginal distributions, expectation, moment generating and characteristic functions, transformations of random variables, central limit theorem and  approximations. Graphical methods, quantile plots, point and interval estimation of population parameters, method of maximum likelihood. Hypotheses testing, simple and multiple regression, correlation analysis, and introduction to Bayesian statistics. Minitab software is used to solve some assignment problems in the course.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"CHE223H1, CME263H1, MSE238H1, MIE236H1MIE237H1, MIE231H1, OR STA257H1","weight":"0.5","aus":{"Math":43.4,"NS":0,"CS":0,"ES":0,"ED":0,"Total":43.4}},{"course":"ECE295H1","title":"Hardware Design and Communication","description":"By the end of this course, students will be able to: 1. Work in a team environment in developing a complex hardware project; 2. Intepret design specifications and translate them into a design that attempts to achieve them; 3. Be familiar with agile methods in hardware development, and apply ideas from these methods in their own design process with their team; 4. Demonstrate proficiency using computer aided design (CAD) and electronic design automation (EDA) techniques for hardware development, in particular, schematic capture and printed circuit board layout tools; 5. Demonstrate ability to solder components, familiarity with surface-mount technology, and awareness of the restriction of hazardous substances directive (RoHS); 6. Be familiar with electrostatic discharge (ESD) handling guidelines and protection; 7. Confidently use using laboratory instruments and apply them for testing circuits and systems; 8. Assemble instruments and controlling software for the purpose of automated hardware testing (test automation); 9. Be aware of standards and regulatory compliance when pursuing industrial design; and 10. Demonstrate confidence preparing oral presentations and written documents on technical engineering hardware design.","session":["Winter"],"prereqs":"ECE212H1 and ECE241H1 and ECE244H1","coreqs":"None","exclusions":"ECE297H1","weight":"","aus":{"Math":0,"NS":0,"CS":9.6,"ES":9.6,"ED":19.2,"Total":38.4}},{"course":"ECE297H1","title":"Communication and Design","description":"\"An introduction to electrical and computer engineering design processes illustrated by the design and implementation of software systems. Creative development with appropriate organizational and reporting and recording activities, both oral and written, is emphasized. The general design cycle and pragmatic strategies used in the creation of small designs and larger systems are presented. These methods are implemented in practical lab work done in teams. Oral skills are developed in seminars and team discussions, by learning to handle questions, and by making formal presentations. Written skills are developed in reports related to the lecture and lab activities.\"","session":["Winter"],"prereqs":"ECE244H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":24.8,"ES":0,"ED":24.8,"Total":49.6}},{"course":"ECE302H1","title":"Probability and Applications","description":"Events, sample space, axioms of probability. Discrete and continuous random variables, distribution and density functions. Bernoulli trials, Binomial, geometric, Poisson, exponential and Gaussian distributions. Expectation, moments, characteristic function and correlation coefficient. Functions of random variables. Random vectors, joint distributions, transformations. Applications will be chosen from communication theory, estimation and hypothesis testing, and other areas of electrical engineering and computer engineering.","session":["Fall","Winter"],"prereqs":"MAT290H1 and MAT291H1 and ECE216H1","coreqs":"None","exclusions":"STA286H1, STA257H1","weight":"0.5","aus":{"Math":50.4,"NS":0,"CS":0,"ES":0,"ED":0,"Total":50.4}},{"course":"ECE311H1","title":"Introduction to Control Systems","description":"An introduction to dynamic systems and their control. Differential equation models of mechanical, electrical, and electromechanical systems. State variable form. Linearization of nonlinear models and transfer functions. Use of Laplace transform to solve ordinary differential equations. Conversion of models from state variable form to transfer function representation and vice versa. Block diagrams and their manipulation. Time response: transient analysis and performance measures. Properties of feedback control systems. Steady state tracking: the notion of system type. The concept of stability of feedback systems, Routh-Hurwitz stability criterion. Frequency response and stability in the frequency domain. Root locus. Bode and Nyquist plots and their use in feedback control design.","session":["Fall","Winter"],"prereqs":"MAT290H1 and MAT291H1 and ECE216H1","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":40.8,"ED":13.6,"Total":54.4}},{"course":"ECE313H1","title":"Energy Systems and Distributed Generation (formerly ECE413H1)","description":"Three-phase systems; steady-state transmission line model; symmetrical three-phase faults; power system stability; symmetrical components; unsymmetrical faults and fault current calculation; distribution network; equivalent steady-state model of voltage-sourced converter; distributed energy resources (DR); distributed energy storage; interface between DR and power system.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":53.4,"ED":0,"Total":53.4}},{"course":"ECE314H1","title":"Fundamentals of Electrical Energy Systems","description":"\"Introduction to 3-phase systems, single line diagrams and complex power flow. Energy conversion via switch-mode power electronic circuits: DC/DC converters, DC/AC converters. Energy conversions via magnetic devices: Faraday's law for time varying fields, characterization of hysteresis and eddy current losses in magnetic materials, modelling of magnetic circuits, transformer and inductor modelling and design. Introduction to electromechanical energy conversion: Lorentz Force, concepts of energy, co-energy, forces between ferromagnetic materials carrying flux, simple magnetic actuators.\"","session":["Fall"],"prereqs":"ECE212H1 and ECE221H1 and ECE231H1","coreqs":"None","exclusions":"ECE315H1 F","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":40.1,"ED":13.4,"Total":53.5}},{"course":"ECE316H1","title":"Communication Systems","description":"\"An introductory course in analog and digital communication systems. Analog and digital signals. Signal representation and Fourier transforms; energy and power spectral densities; bandwidth. Distortionless analog communication; amplitude, frequency and phase modulation systems; frequency division multiplexing. Sampling, quantization and pulse code modulation (PCM). Baseband digital communication; intersymbol interference (ISI); Nyquist's ISI criterion; eye diagrams. Passband digital communications; amplitude-, phase- and frequency-shift keying; signal constellations. Performance analysis of analog modulation schemes in the presence of noise. Performance analysis of PCM in noise.\"","session":["Fall","Winter"],"prereqs":"MAT290H1 and ECE216H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":53.4,"ED":0,"Total":53.4}},{"course":"ECE318H1","title":"Fundamentals of Optics","description":"\"Geometric Optics: Spherical surfaces, lenses and mirrors, optical imaging systems, matrix method, and aberrations. Polarization:  Polarizer and polarizations, anisotropic materials, dichroism, birefringence, index ellipsoid, waveplates, optical activity, Faraday effect. Interference: superposition of waves, longitudinal and transverse coherence, Young's double-slit experiment, Michelson and Fabry-Perot interferometer, thin-films. Diffraction and Fourier Optics: diffraction theory, single and double slits, diffraction gratings, spatial filtering, basic optical signal processing.  (Background preparation in ECE320H1 F - Fields and Waves, or ECE357H1 S - Electromagnetic Fields, is strongly recommended.)\"","session":["Winter"],"prereqs":"ECE221H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":32,"CS":0,"ES":21.4,"ED":0,"Total":53.4}},{"course":"ECE320H1","title":"Fields and Waves","description":"\"Voltage and current waves on a general transmission line, reflections from the load and source, transients on the line, and Smith's chart. Maxwell's equations, electric and magnetic fields wave equations, boundary conditions, plane wave propagation, reflection and transmission at boundaries, constitutive relations, dispersion, polarization; Poynting vector; waveguides. \"","session":["Fall"],"prereqs":"ECE221H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":32,"CS":0,"ES":21.4,"ED":0,"Total":53.4}},{"course":"ECE324H1","title":"Introduction to Machine Intelligence","description":"This course will provide students with an introduction to machine learning engineering, as a software and engineering discipline. It focuses on the neural network method. Lectures will cover the basic mathematics and intuitions behind neural networks, in particular deep convolutional neural networks, and their application as classifiers and predictions using regression. There will be a focus on conveying known methods to make neural network training succeed. Other topics may include Natural Language Processing basics, recurrent neural networks, transfer learning and generative adversarial networks. There will be reflection on ethics in machine learning. A significant component of the course will be hands-on exposure to a machine-learning software framework, culminating in a design project.","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"MIE324H1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":33.6,"ED":11.2,"Total":44.8}},{"course":"ECE326H1","title":"Programming Languages (formerly CSC326H1)","description":"Study of programming styles and paradigms. Included are object-oriented scripting functional and logic-based approaches. Languages that support these programming styles will be introduced. Languages treated include Python, Lisp or Scheme and Prolog.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"CSC324H1, CSC326H1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":40.1,"ED":13.4,"Total":53.5}},{"course":"ECE330H1","title":"Quantum and Semiconductor Physics","description":"This course introduces the principles of quantum physics and uses them to understand the behaviour of semiconductors.  Topics to be covered include wave-particle duality, Schrodinger's equation, energy quantization, quantum mechanical tunnelling, electrons in crystalline semiconductors, and other physical concepts that form the basis for nanotechnology, microelectronics and optoelectronics.  Prerequisite:  ECE221H1 and ECE231H1.  Exclusion:  MSE235H1.","session":["Winter"],"prereqs":"ECE221H1 and ECE231H1","coreqs":"None","exclusions":"MSE235H1, MSE335H1","weight":"0.5","aus":{"Math":0,"NS":30.2,"CS":0,"ES":20.2,"ED":0,"Total":50.4}},{"course":"ECE331H1","title":"Analog Electronics","description":"\"Transistor amplifiers, including: differential and multistage amplifiers, integrated circuit biasing techniques, output stage design and IC amplifier building blocks. Frequency response of amplifiers at low, medium and high frequencies. Feedback amplifier analysis. Stability and compensation techniques for amplifiers using negative feedback.\"","session":["Fall"],"prereqs":"ECE212H1 and ECE231H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":37.4,"ED":16,"Total":53.4}},{"course":"ECE334H1","title":"Digital Electronics","description":"\"Digital design techniques for integrated circuits. The emphasis will be on the design of logic gates at the transistor level. A number of different logic families will be described, but CMOS will be emphasized. Review of: device modeling, IC processing, and Spice simulation, simplified layout rules, inverter noise margins, transient response, and power dissipation, traditional CMOS logic design, transmission gates, RC timing approximations, input-output circuits, latches and flipflops, counters and adders, decoders and muxes, dynamic gates, SRAMs, DRAMs, and EEPROMs.\"","session":["Fall","Winter"],"prereqs":"ECE241H1 and ECE231H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":38.1,"ED":16.3,"Total":54.4}},{"course":"ECE335H1","title":"Introduction to Electronic Devices","description":"\"Electrical behaviour of semiconductor structures and devices. Metal-semiconductor contacts; pn junctions, diodes, photodetectors, LED's; bipolar junction transistors, Ebers-Moll and hybrid-pi models; field effect transistors, MOSFET, JFET/MESFET structures and models; thyristors and semiconductor lasers. \"","session":["Fall"],"prereqs":"MAT291H1 and ECE221H1 and ECE231H1","coreqs":"None","exclusions":"MSE235H1 or MSE335H1","weight":"0.5","aus":{"Math":0,"NS":15.1,"CS":0,"ES":35.3,"ED":0,"Total":50.4}},{"course":"ECE342H1","title":"Computer Hardware","description":"\"Arithmetic circuits, cubical representation of logic functions, digital system design, timing analysis, design of asynchronous circuits, testing of logic circuits.\"","session":["Winter"],"prereqs":"ECE241H1 and ECE243H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":26.7,"ED":26.7,"Total":53.4}},{"course":"ECE344H1","title":"Operating Systems","description":"\"Operating system structures, concurrency, synchronization, deadlock, CPU scheduling, memory management, file systems. The laboratory exercises will require implementation of part of an operating system.\"","session":["Fall","Winter"],"prereqs":"ECE244H1 and ECE243H1","coreqs":"None","exclusions":"ECE353H1 S","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":32,"ED":21.4,"Total":53.4}},{"course":"ECE345H1","title":"Algorithms & Data Structures","description":"\"Design and analysis of algorithms and data structures that are essential to engineers in every aspect of the computer hardware and software industry. Review of background material (recurrences, asymptotics, summations, trees and graphs). Sorting, search trees and balanced search trees, amortized analysis, hash functions, dynamic programming, greedy algorithms, basic graph algorithms, minimum spanning trees, shortest paths, introduction to NP completeness and new trends in algorithms and data structures.\"","session":["Fall","Winter"],"prereqs":"ECE244H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":37.8,"ED":12.6,"Total":50.4}},{"course":"ECE349H1","title":"Introduction to Energy Systems","description":"\"Established and emerging sources of electrical energy: hydroelectric, thermal, wind, and solar. Three-phase AC systems and complex power. Mechanisms for electrical-electrical energy conversion: power electronic systems for DC-DC conversion, single-phase DC-AC and three-phase DC-AC conversion, transformers for single-phase and three-phase AC-AC conversion. Electro-mechanical energy conversion via the synchronous machine. Fundamentals of AC electrical energy networks: frequency regulation, voltage regulation, and protection.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":54.4,"ED":0,"Total":54.4}},{"course":"ECE350H1","title":"Semiconductor Electronic Devices","description":"\"The crystal lattice and basis; real and reciprocal space; diffraction experiments. Electronic theory of semiconductors: energy bands, crystal momentum, effective mass, holes. Semiconductors in equilibrium: Fermi-Dirac statistics, electron and hole densities, donors and acceptors. Carrier transport. Excess carriers, generation and recombination, lifetime, ambipolar diffusion. Semiconductor diodes: the ideal p-n junction, non-idealities, small signal and transient response, photodiode, LED, semiconductor laser; metal semiconductor contact; heterojunctions. MOS capacitor, MOST. BJT: carrier distribution, currents, the Ebers-Moll model, small signal parameters, switching, secondary effects.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":16.3,"CS":0,"ES":38.1,"ED":0,"Total":54.4}},{"course":"ECE352H1","title":"Computer Organization","description":"\"A continuation of some of the topics introduced in ECE253F, Digital and Computer Systems. Synchronous and asynchronous sequential circuits, pipelining, integer and floating-point arithmetic, RISC processors.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":28.8,"ED":28.8,"Total":57.6}},{"course":"ECE353H1","title":"Systems Software","description":"\"Operating system structure, processes, threads, synchronization, CPU scheduling, memory management, file systems, input/output, multiple processor systems, virtualization, protection, and security. The laboratory exercises will require implementation of part of an operating system.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":57.6,"ED":0,"Total":57.6}},{"course":"ECE354H1","title":"Electronic Circuits","description":"\"A course on analog and digital electronic circuits. Topics include single-stage amplifiers, current mirrors, cascode amplifiers and differential pairs. Amplifier frequencey response, feedback and stability are also covered. Digital CMOS logic circuits are introduced.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":25.6,"ED":25.6,"Total":51.2}},{"course":"ECE355H1","title":"Signal Analysis and Communication","description":"\"An introduction to continuous-time and discrete-time signals and systems. Topics include characterization of linear time-invariant systems, Fourier analysis, linear filtering, sampling of continuous-time signals, and modulation techniques for communication systems.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":51.2,"ED":0,"Total":51.2}},{"course":"ECE356H1","title":"Linear Systems and Control","description":"An introduction to dynamic systems and their control. Differential equation models of physical systems using transfer functions and state space models. Linearization. Initial and input response. Stability theory. Principle of feedback. Internal Model Principle. Frequencey response. Nyquist stability. Loop shaping theory. Computer aided design using MATLAB and Simulink.","session":["Winter"],"prereqs":"ECE355H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":40.8,"ED":13.6,"Total":54.4}},{"course":"ECE357H1","title":"Electromagnetic Fields","description":"\"An introduction to transmission line theory: voltage and current waves, characteristic impedance, reflections from the load and source, transients on the line, Smith's chart, impedance matching. Fundamentals of electromagnetic theory: Maxwell's equations, Helmholtz's theorem, time retarded scalar and vector potentials, gauges, boundary conditions, electric and magnetic fields wave equations and their solutions in lossless and lossy medium. Plane wave propagation, reflection and transmission at boundaries. Constitutive relations and dispersion. Radiating dipole and waveguides.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":54.4,"ED":0,"Total":54.4}},{"course":"ECE358H1","title":"Foundations of Computing","description":"\"Fundamentals of algorithm design and computational complexity, including: analysis of algorithms, graph algorithms, greedy algorithms, divide-and-conquer, dynamic programming, network flow, approximation algorithms, the theory of NP-completeness, and various NP-complete problems.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":44.8,"ED":0,"Total":44.8}},{"course":"ECE360H1","title":"Electronics","description":"\"An introduction to electronics. Basic electronic circuits: introductory frequency analysis, operational amplifiers, diodes, bipolar junction transistors, field-effect transistors, small-signal analysis, frequency response of single-stage circuits.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":27.2,"ED":27.2,"Total":54.4}},{"course":"ECE361H1","title":"Computer Networks I","description":"Layered network architectures; overview of TCP/IP protocol suite. Introduction to sockets; introduction to application layer protocols. Peer-to-Peer Protocols: ARQ; TCP reliable stream service; flow control. Data Link Controls: Framing; PPP; HDLC. Medium access control and LANs: Aloha; Ethernet; Wireless LANs; Bridges. Packet Switching: Datagram and virtual circuit switching; Shortest path algorithms; Distance vector and link state algorithms. Students must take the co-requisite, ECE302H1 in the same term as ECE361H1 , OR in the term before taking ECE361H1.","session":["Fall","Winter"],"prereqs":"None","coreqs":"ECE302H1","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":40.1,"ED":13.4,"Total":53.5}},{"course":"ECE363H1","title":"Communication Systems","description":"An introductory course in analog and digital communication systems.  Analog and digital signals.  Probability and random processes.  Energy and power spectral densities; bandwidth.  Distortionless analog communication; amplitude, frequency and phase modulation systems; frequency division multiplexing.  Sampling, quantization and pulse code modulation (PCM).  Baseband digital communication; intersymbol interference (ISI); Nyquist's ISI criterion; eye diagrams.  Passband digital communications; amplitude-, phase- and frequency-shift keying; signal constellations.  Performance analysis of analog modulation schemes in the presence of noise.  Performance analysis of PCM in noise.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":0,"ED":0,"Total":0}},{"course":"ECE367H1","title":"Matrix Algebra and Optimization","description":"This course will provide students with a grounding in optimization methods and the matrix algebra upon which they are based. The first part of the course focuses on fundamental building blocks in linear algebra and their geometric interpretation: matrices, their use to represent data and as linear operators, and the matrix decompositions (such as eigen-, spectral-, and singularvector decompositions) that reveal structural and geometric insight. The second part of the course focuses on optimization, both unconstrained and constrained, linear and non-linear, as well as convex and non-convex; conditions for local and global optimality, as well as basic classes of optimization problems are discussed. Applications from machine learning, signal processing, and engineering are used to illustrate the techniques developed. Prerequisite: AER210H1/MAT290H1, MAT185H1/MAT188H1","session":["Fall"],"prereqs":"(AER210H1 or MAT290H1) and (MAT185H1 or MAT188H1)","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":25.6,"NS":0,"CS":0,"ES":25.6,"ED":0,"Total":51.2}},{"course":"ECE368H1","title":"Probabilistic Reasoning","description":"This course will focus on different classes of probabilistic models and how, based on those models, one deduces actionable information from data.  The course will start by reviewing basic concepts of probability including random variables and first and second-order statistics.  Building from this foundation the course will then cover probabilistic models including vectors (e.g., multivariate Gaussian), temporal (e.g., stationarity and hidden Markov models), and graphical (e.g., factor graphs).  On the inference side topics such as hypothesis testing, marginalization, estimation, and message passing will be covered.  Applications of these tools cover a vast range of data processing domains including machine learning, communications, search, recommendation systems, finance, robotics and navigation.","session":["Winter"],"prereqs":"STA286H1 or ECE302H1","coreqs":"None","exclusions":"CSC412H1","weight":"","aus":{"Math":33.6,"NS":0,"CS":0,"ES":11.2,"ED":0,"Total":44.8}},{"course":"ECE410H1","title":"Linear Control Systems","description":"\"State space analysis of linear systems, the matrix exponential, linearization of nonlinear systems. Structural properties of linear systems: stability, controllability, observability, stabilizability, and detectability. Pole assignment using state feedback, state estimation using observers, full-order and reduced-order observer design, design of feedback compensators using the separation principle, control design for tracking. Control design based on optimization, linear quadratic optimal control, the algebraic Riccati equation. Laboratory experiments include computer-aided design using MATLAB and the control of an inverted pendulum on a cart.\"","session":["Fall"],"prereqs":"ECE311H1","coreqs":"None","exclusions":"ECE557H1 F","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":40.1,"ED":13.4,"Total":53.5}},{"course":"ECE411H1","title":"Real-Time Computer Control","description":"\"Digital Control analysis and design by state-space methods. Introduction to scheduling of control tasks using fixed-priority protocols. Labs include control design using MATLAB and Simulink, and computer control of the inverted pendulum using a PC with real-time software.\"","session":["Winter"],"prereqs":"ECE311H1 or ECE356H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":40.1,"ED":13.4,"Total":53.5}},{"course":"ECE412H1","title":"Analog Signal Processing Circuits (formerly ECE512H1)","description":"An overview of continuous-time and discrete-time signal processing techniques, and the analysis and design of analog and mixed-signal circuit building blocks used in modern electronic systems. Topics covered include: analysis, specification, simulation, and design of continuous-time filters with linear transconductors and op-amps; phase-domain model, noise model, and design methodology for low phase noise Phase Lock Loops and associated building blocks (VCO, phase-frequency detector, charge pump); discrete-time signal analysis using z-transform; discrete-time filter design based on switched capacitors; as well as fundamentals, architectures, building blocks, and characterization techniques for digital-to-analog and analog-to-digital converters. Prerequisite: ECE331H1 or ECE354H1. Exclusion: ECE512H1","session":["Winter"],"prereqs":"ECE331H1","coreqs":"None","exclusions":"ECE512H1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":25.2,"ED":25.2,"Total":50.4}},{"course":"ECE417H1","title":"Digital Communication","description":"\"Basic concepts of digital communication. Baseband data transmission, intersymbol interference, Nyquist pulse shaping, equalization, line coding, multi-path fading, diversity. Binary and M-ary modulation schemes, synchronization. Signal space concepts, optimum receivers, coherent and noncoherent detectors. Information theory, source encoding, error control coding, block and convolutional codes.\"","session":["Fall"],"prereqs":"ECE302H1 and ECE316H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":40.1,"ED":13.4,"Total":53.5}},{"course":"ECE419H1","title":"Distributed Systems","description":"Design issues in distributed systems: heterogeneity, security, transparency, concurrency, fault-tolerance; networking principles; request-reply protocol; remote procedure calls; distributed objects; middleware architectures; CORBA; security and authentication protocols; distributed file systems; name services; global states in distributed systems; coordination and agreement; transactions and concurrency control; distributed transactions; replication.","session":["Winter"],"prereqs":"ECE344H1 or ECE353H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":26.7,"ED":26.7,"Total":53.4}},{"course":"ECE421H1","title":"Introduction to Machine Learning","description":"This course will introduce students to the basic theory, the fundamental algorithms, and the computational toolboxes of machine learning. The course will aim for a balanced treatment of the practical and theoretical approaches, along with hands on experience with relevant software packages. Supervised learning methods covered in the course will include: the study of linear models for classification and regression, neural networks and support vector machines. Unsupervised learning methods covered in the course will include: principal component analysis, k-means clustering, and Gaussian mixture models. Theoretical topics will include:  bounds on the generalization error, bias-variance tradeoffs and the Vapnik-Chervonenkis (VC) dimension. Techniques to control overfitting, including regularization and validation, will be covered.","session":["Fall","Winter"],"prereqs":"ECE302H1 or ECE286H1 or CHE223H1 or MIE231H1 or MIE236H1 or MSE238H1 or STA286H1","coreqs":"None","exclusions":"CSC411H1, ECE521H1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":50.4,"ED":0,"Total":50.4}},{"course":"ECE422H1","title":"Radio and Microwave Wireless Systems","description":"Analysis and design of systems employing radio waves, covering both the underlying electromagnetics and the overall system performance aspects such as signal-to-noise ratios. Transmission/reception phenomena include: electromagnetic wave radiation and polarization; elementary and linear dipoles; directivity, gain, efficiency; integrated, phased-array and aperture antennas; beam-steering; Friis transmission formula and link budget. Propagation phenomena include: diffraction and wave propagation over obstacles; multipath propagation; atmospheric and ionospheric effects. Receiver design aspects include: radio receiver architectures, receiver figures of merit, noise in cascaded systems, noise figure, and noise temperature. System examples are: terrestrial communication systems; satellite communications; radar; radiometric receivers; software-defined radio.","session":["Winter"],"prereqs":"ECE320H1 or ECE357H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":40.1,"ED":13.4,"Total":53.5}},{"course":"ECE424H1","title":"Microwave Circuits (formerly ECE524H1)","description":"Losses in conductors and dielectrics; RF and microwave transmission lines; transients on transmission lines; matching networks; planar transmission lines (microstrip, stripline, coplanar waveguide); design with scattering parameters; 3- and 4-port RF devices (power dividers/combiners, couplers, isolators & circulators); coupled lines and devices; microwave active circuits (RF amplifiers, mixers, and receiver front ends); RF and microwave filters. The hands-on laboratories engage students in the design, simulation, fabrication, and test of practical passive and active microwave circuits using industry-standard RF/microwave simulation tools and measurement systems.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"ECE524H1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":26.7,"ED":26.7,"Total":53.4}},{"course":"ECE427H1","title":"Photonic Devices","description":"This course introduces concepts for analyzing and designing photonic devices that serve a wide range of applications, such as communications, sensing, and energy harvesting. Topics to be covered include light propagation in uniform and periodic media; optical waveguides; power splitters and couplers;  wavelength filters; interferometers and resonators; amplifiers and lasers; photonic integration. Prerequisite:  ECE318H1 or ECE320H1 or ECE357H1.","session":["Fall"],"prereqs":"ECE318H1 or ECE320H1","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":50.4,"ED":0,"Total":50.4}},{"course":"ECE430H1","title":"Analog Integrated Circuits (formerly ECE530H1)","description":"Review of MOSFET semiconductor device equations. Noise in electronic devices. Review of single-stage amplifiers and frequency response, including noise analysis. Basic CMOS op amp. Op amp compensation. Advanced op amp circuits: telescopic and folded-cascode op amps. Fully-differential op amps. Common mode feedback. Pre-requisites: ECE331","session":["Fall"],"prereqs":"ECE331H1","coreqs":"None","exclusions":"ECE530H1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":26.7,"ED":26.7,"Total":53.4}},{"course":"ECE431H1","title":"Digital Signal Processing","description":"An introductory course in digital filtering and applications. Introduction to real world signal processing. Review of sampling and quantization of signals. Introduction to the discrete Fourier transform and its properties. The fast Fourier transform. Fourier analysis of signals using the discrete Fourier transform. Structures for discrete-time systems. Design and realization of digital filters: finite and infinite impulse response filters. DSP applications in areas such as communications, multimedia, video coding, human computer interaction and medicine.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":40.1,"ED":13.4,"Total":53.5}},{"course":"ECE437H1","title":"VLSI Technology","description":"The introduction to VLSI fabrication techniques, integrated circuit designs and advanced semiconductor devices will give a proper perspective of the past, present and future trends in the VLSI industry. Following the evolution of MOS and bipolar devices, digital and analog CMOS, BiCMOS, deep submicron CMOS, SOI-CMOS, RF-CMOS and HV-CMOS technologies will be studied. Special attention will be given to the physical scaling limits such as short channel effects. In addition, CAD tools and design methodology for the development of advanced semiconductor devices and integrated circuits will be introduced in the laboratory environment. These include the simulation of device fabrication, device characteristics, device modeling, circuit layout and design verification. Finally, advanced technology such as GaN HEMTs, graphene devices, carbon nano-tube devices, power devices, heterojunctions, InP and GaSb HBTs will also be studied. (ECE331H1 or ECE334H1 or ECE354H1) and (ECE335H1 or ECE350H1)","session":["Winter"],"prereqs":"(ECE331H1 or ECE334H1 or ECE354H1) and (ECE335H1 or ECE350H1)","coreqs":"None","exclusions":"ECE534H1 and ECE535H1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":26.7,"ED":26.7,"Total":53.4}},{"course":"ECE444H1","title":"Software Engineering (formerly CSC444H1)","description":"The software development process. Software requirements and specifications. Software design techniques. Techniques for developing large software systems; CASE tools and software development environments. Software testing, documentation and maintenance.","session":["Fall"],"prereqs":"ECE344H1 or ECE353H1","coreqs":"None","exclusions":"CSC444H1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":26.7,"ED":26.7,"Total":53.4}},{"course":"ECE445H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ECE446H1","title":"Sensory Communication","description":"\"Physical acoustics, acoustic measurements, electroacoustic transducers, and physiological acoustics. Speech processing, speech recognition algorithms and signal processing by the auditory system. Engineering aspects of acoustic design. Electrical models of acoustic systems. Noise, noise-induced hearing loss, and noise control. Introduction to vision and other modalities. Musical and psychoacoustics.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":11.9,"CS":0,"ES":16.6,"ED":19,"Total":47.5}},{"course":"ECE448H1","title":"Biocomputation","description":"\"New technologies in molecular and cellular biology have allowed the collection of unprecedented amounts of biological data ranging from sequences to protein structures to gene expression. The need to synthesize knowledge from this abundant data is driving the convergence of the biological and computer sciences. This course will introduce the fundamental concepts and challenges in molecular biology and the computational and statistical approaches applied to model and address them. Course topics include basic concepts in molecular and structural biology, sequence-based algorithms (such as pairwise and multiple sequence alignment, statistical models), structure-based algorithms (such as energy models, homology modeling, threading), and systems biology algorithms (such as hierarchal and neural network clustering).\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":12.6,"CS":0,"ES":37.8,"ED":0,"Total":50.4}},{"course":"ECE454H1","title":"Computer Systems Programming","description":"\"This course teaches fundamental techniques for programming computer systems, with an emphasis on obtaining good performance. The course will focus on system behaviour and operation, covering important concepts such as finite precision number representations, manipulation of bits and bytes at a low level, program operation at the machine level, memory allocation and management, the use of memory hierarchy for good performance, measuring and optimizing program performance. The course will also cover other selected advanced topics in programming techniques. Students will gain hands-on experience in a variety of topics and programming environments, and a deeper understanding of how to program computer systems for high performance and efficiency.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":26.7,"ED":26.7,"Total":53.4}},{"course":"ECE455H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ECE461H1","title":"Internetworking","description":"\"This course will cover the fundamentals of protocols for packet switching networks with emphasis on Internet type of networks including the following topics: the Internetworking concept and architectural model; data link layer (Ethernet and PPP); service interface; Internet addresses; address resolution protocol; Internet protocol (connectionless datagram delivery); routing IP datagrams; Internet control message protocol (error and control messages); subnet and supernet address extensions; ping program; traceroute program; user datagram protocol; reliable stream transport service (TCP); the socket interface; routing (GGP, EGP, IP, OSPF, HELLO); Internet multicasting; domain name system; applications such as HTTP, electronic mail, and SNMP; Internet security and firewall design; Ipv6, RSVP, flows, and ISIP.\"","session":["Fall"],"prereqs":"ECE361H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":53.4,"ED":0,"Total":53.4}},{"course":"ECE462H1","title":"Multimedia Systems","description":"\"Topics in the engineering area of multimedia systems with particular emphasis on the theory, design features, performance, complexity analysis, optimization and application of multimedia engineering technologies. Topics include sound/audio, image and video characterization, compression, source entropy and hybrid coding, transform coding, wavelet-based coding, motion estimation, JPEG coding, digital video coding, MPEG-1/2 coding, content-based processing, and MPEG-7.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":48.4,"ED":0,"Total":48.4}},{"course":"ECE463H1","title":"Electric Drives","description":"\"Electro-mechanical mechanisms for force and torque production in rotating machines. DC machine theory and DC machine dynamics, synchronous machines and their dynamics, stepper motors. Introduction to space vectors and vector control of AC machines.  Steady state and variable speed operation of the induction machine via V/f control.\"","session":["Winter"],"prereqs":"ECE314H1 or ECE315H1 or ECE349H1 or ECE359H1","coreqs":"ECE311H1 or ECE356H1 or AER372","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":40.1,"ED":13.4,"Total":53.5}},{"course":"ECE464H1","title":"Wireless Communication","description":"\"The radio medium, radio communication system examples. Link budget: cable losses, propagation loss, antenna gains. Basic concepts of propagation: path loss, multi-path propagation and fading. Raleigh and Rician fading models, Doppler shift, delay spread, coherence time and coherence bandwidth of the channel. Analog modulation schemes and their bandwidths. Digital modulation schemes and their bandwidths and bit rates: BPSK, QPSK, MSK, GMSK. Basic concepts of speech coding. Error correction coding, interleaving, and multiple access frame structure. The physical layer description of the AMPS, IS-54, and GSM cellular systems. The cellular concept: frequency re-use, re-use cluster concept. Channel allocation. Cellular system architecture for AMPS, IS-54, and GSM. Hand-offs and transmitter power control. Cellular traffic, call blocking, concept of Erlangs. Basic ideas in spread spectrum modulation, spreading codes, bit error probability. Orthogonal and non-orthogonal CDMA Basic concepts in CDMA networks.\"","session":["Winter"],"prereqs":"ECE302H1 and ECE316H1 and ECE417H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":40.1,"ED":13.4,"Total":53.5}},{"course":"ECE466H1","title":"Computer Networks II","description":"\"Traffic modeling; network calculus; traffic classification; traffic regulation: shaping, filtering, policing, leaky bucket; queueing systems; scheduling; quality of service: Diffserv and IntServ/RSVP; multi-protocol label switching; call admission control / congestion control; switching; pricing; optical networks.\"","session":["Winter"],"prereqs":"ECE361H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":40.1,"ED":13.4,"Total":53.5}},{"course":"ECE467H1","title":"Compilers and Interpreters (formerly CSC467H1)","description":"Compiler organization, compiler writing tools, use of regular expressions, finite automata and context-free grammars, scanning and parsing, runtime organization, semantic analysis, implementing the runtime model, storage allocation, code generation.","session":[],"prereqs":"ECE243H1","coreqs":"None","exclusions":"CSC467H1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":40.1,"ED":13.4,"Total":53.5}},{"course":"ECE469H1","title":"Optical Communications and Networks","description":"\"This course provides an introduction to optical communication systems and networks at the system and functional level.  Applications range from telecommunication networks (short to long haul) to computing networks (chip-to-chip, on chip communications, optical backplanes).  Basic principles of optical transmission and associated components used for transmission of light and optical networks; system design tools for optical links; multi-service system requirements; optical network design tools (routing and wavelength assignment), network management and survivability.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"ECE425S or ECE467S","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":13.4,"ED":40.1,"Total":53.5}},{"course":"ECE470H1","title":"Robot Modeling and Control","description":"\"Classification of robot manipulators, kinematic modeling, forward and inverse kinematics, velocity kinematics, path planning, point-to-point trajectory planning, dynamic modeling, Euler-Langrange equations, inverse dynamics, joint control, computed torque control, passivity-based control, feedback linearization.\"","session":["Fall","Winter"],"prereqs":"ECE311H1 or ECE356H1","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":13.4,"CS":0,"ES":40.1,"ED":0,"Total":53.5}},{"course":"ECE472H1","title":"Engineering Economic Analysis & Entrepreneurship","description":"The economic evaluation and justification of engineering projects and investment proposals are discussed. Cost concepts; financial and cost accounting; depreciation; the time value of money and compound interest; inflation; capital budgeting; equity, bond and loan financing; income tax and after-tax cash flow in engineering project proposals; measures of economic merit in the public sector; sensitivity and risk analysis. Applications: evaluations of competing engineering project alternatives; replacement analysis; economic life of assets; lease versus buy decisions; break-even and sensitivity analysis. Entrepreneurship and the Canadian business environment will be discussed.","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":50.4,"ES":0,"ED":0,"Total":50.4}},{"course":"ECE488H1","title":"Entrepreneurship and Business for Engineers","description":"\"A complete introduction to small business formation, management and wealth creation. Topics include: the nature of the Entrepreneur and the Canadian business environment; business idea search and Business Plan construction; Buying a business, franchising, taking over a family business; Market research and sources of data; Marketing strategies promotion, pricing, advertising, electronic channels and costing; The sales process and management, distribution channels and global marketing; Accounting, financing and analysis, sources of funding, and financial controls; The people dimension: management styles, recruiting and hiring, legal issues in employment and Human Resources; Legal forms of organization and business formation, taxation, intellectual property protection; the e-Business world and how businesses participate; Managing the business: location and equipping the business, suppliers and purchasing, credit, ethical dealing; Exiting the business and succession, selling out. A full Business Plan will be developed by each student and the top submissions will be entered into a Business Plan competition with significant cash prices for the winners. Examples will be drawn from real business situations including practicing entrepreneurs making presentations and class visits during the term. (Identical courses are offered: MSE488H1F, MIE488H1F, CHE488H1S and CIV488H1S.)\"","session":[],"prereqs":"None","coreqs":"None","exclusions":"APS234 and APS432","weight":"0.5","aus":{"Math":0,"NS":0,"CS":51.2,"ES":0,"ED":0,"Total":51.2}},{"course":"ECE496Y1","title":"Design Project","description":"\"A full year capstone design project course intended to give students an opportunity to apply their technical knowledge and communication skills. Working in teams under the direct supervision of a faculty member, students develop a design project of their choice from an initial concept to a final working prototype. In the first session, a project proposal is submitted early on, followed by a project requirements specification. A design review meeting is then held to review the proposed design. Lectures given during the first session will develop expertise in various areas related to design and technical communication. In the second session, the teams present their work in a number of ways, including an oral presentation, a poster presentation, a final demonstration at the Design Fair, an individual progress report, and a group final report. Course deliverables are evaluated by both the teams supervisor and one of several course administrators.\"","session":["Fall"],"prereqs":"To be eligible to register for the capstone course, you must have taken at least 7 technical electives or 6 technical electives plus ECE472H1.","coreqs":"None","exclusions":"None","weight":"1","aus":{"Math":0,"NS":0,"CS":0,"ES":0,"ED":107.8,"Total":107.8}},{"course":"ECE499H1","title":"Research Thesis","description":"The course consists of a research project conducted under the supervision of an ECE faculty member. Research projects must be arranged individually between the student and a supervising faculty member, subject to the approval of the Associate Chair, Undergraduate. The thesis should have a research focus. The students work must culminate in a final thesis document. The student is also required to submit a set of deliverables, including a proposal.  The course may be undertaken only once, either in the Fall (F) or Winter (S) Session (0.5 weight), or as a full year (Y) course (1.0 weight). Taking this course requires approval of the Associate Chair, Undergraduate.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"ECE499Y1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":53.9,"ED":0,"Total":53.9}},{"course":"ECE499Y1","title":"Research Thesis","description":"The course consists of a research project conducted under the supervision of an ECE faculty member. Research projects must be arranged individually between the student and a supervising faculty member, subject to the approval of the Associate Chair, Undergraduate. The thesis should have a research focus. The students work must culminate in a final thesis document. The student is also required to submit a set of deliverables, including a proposal.  The course may be undertaken only once, either in the Fall (F) or Winter (S) Session (0.5 weight), or as a full year (Y) course (1.0 weight). Taking this course requires approval of the Associate Chair, Undergraduate.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"ECE499H1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":107.8,"ED":0,"Total":107.8}},{"course":"ECE516H1","title":"Intelligent Image Processing","description":"\"This course provides the student with the fundamental knowledge needed in the rapidly growing field of Personal Cybernetics, including \"Wearable Computing\", \"Personal Technologies\", \"Human Computer Interaction (HCI),\"\" \"\"Mobile Multimedia,\"\" \"\"Augmented Reality,\"\" \"\"Mediated Reality,\"\" CyborgLogging,\"\" and the merging of communications devices such as portable telephones with computational and imaging devices.  The focus is on fundamental aspects and new inventions for human-computer interaction.  Topics to be covered include: mediated reality, Personal Safety Devices, lifelong personal video capture, the Eye Tap principle, collinearity criterion, comparametric equations, photoquantigraphic imaging, lightvector spaces, anti-homomorphic imaging, application of personal imaging to the visual arts, and algebraic projective geometry.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":41.2,"ED":13.7,"Total":54.9}},{"course":"ECE520H1","title":"Power Electronics","description":"The course focuses on power electronic converters utilized in applications ranging from low-power mobile devices to higher power applications such as electric vehicles, server farms, microgrids, and renewable energy systems.  Concepts covered include the principles of efficient electrical energy processing (dc-dc, dc/ac, and ac/ac) through switch-mode energy conversion, converter loss analysis, large- and small-signal modeling of power electronic circuits and controller design.","session":["Fall"],"prereqs":"(ECE314H1 or ECE315H1 or ECE349H1 or ECE359H1)","coreqs":"None","exclusions":"ECE514H1 and ECE533H1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":26.7,"ED":26.7,"Total":53.4}},{"course":"ECE525H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ECE526H1","title":"Power System Protection and Automation","description":"This course presents the concepts of short-circuit fault analysis, protective relaying, and automation in power systems. The course starts by discussing the causes and types of short-circuit faults using real-world examples. The consequences of faults for different power system components will be reviewed using event reports from field data. The method of symmetrical components for analyzing unbalanced three-phase systems will be introduced. Analytical methods and computer-based approaches for deriving fault voltages and currents will be discussed and the effect of system grounding during transient conditions, including faults, will be introduced. Students will also learn the concept of power system automation and its role in monitoring, protection. and control of modern power systsms.  Critical devices used in an automation system, such as breakers, relays, reclosers, capacitor bank controllers, and tap changer controllers will be presented.","session":["Fall"],"prereqs":"(ECE313H1 or ECE314H1 or ECE349H1 or ECE359H1)","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":53.4,"ED":0,"Total":53.4}},{"course":"ECE532H1","title":"Digital Systems Design","description":"\"Advanced digital systems design concepts including project planning, design flows, embedded processors, hardware/software interfacing and interactions, software drivers, embedded operating systems, memory interfaces, system-level timing analysis, clocking and clock domains. A significant design project is undertaken and implemented on an FPGA development board.\"","session":["Winter"],"prereqs":"ECE342H1 or ECE352H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":21.4,"ED":32,"Total":53.4}},{"course":"ECE537H1","title":"Random Processes","description":"\"Introduction to the principles and properties of random processes, with applications to communications, control systems, and computer science. Random vectors, random convergence, random processes, specifying random processes, Poisson and Gaussian processes, stationarity, mean square derivatives and integrals, ergodicity, power spectrum, linear systems with stochastic input, mean square estimation, Markov chains, recurrence, absorption, limiting and steady-state distributions, time reversibility, and balance equations.\"","session":["Fall"],"prereqs":"ECE302H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":50.4,"NS":0,"CS":0,"ES":0,"ED":0,"Total":50.4}},{"course":"ECE552H1","title":"Computer Architecture","description":"\"Performance analysis and metrics and cost. Instruction set architectures. Instruction-level parallelism: pipelining, superscalar, dynamic scheduling, VLIW processors.  Data-level prallelism:  vector processors, GPUs.  Thread-level parallelism: multiprocessors, multi-core, coherence, simultaneous multi-threading.  Memory hierarchies: caches and virtual memory support.  Simulation tools and methods.  Limited Enrollment.\"","session":["Fall"],"prereqs":"ECE243H1 or ECE352H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":26.7,"ED":26.7,"Total":53.4}},{"course":"ECE557H1","title":"Systems Control","description":"\"State-space approach to linear system theory. Mathematical background in linear algebra, state space equations vs. transfer functions, solutions of linear ODE's, state transition matrix, Jordan form, controllability, eigenvalue assignment using state feedback, observability, designing observers, separation principle, Kalman filters, tracking and the regulator problem, linear quadratic optimal control, stability. Laboratories cover the state space control design methodology.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"ECE410H1 F","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":40.8,"ED":13.6,"Total":54.4}},{"course":"ECE568H1","title":"Computer Security","description":"\"As computers permeate our society, the security of such computing systems is becoming of paramount importance. This course covers principles of computer systems security. To build secure systems, one must understand how attackers operate. This course starts by teaching students how to identify security vulnerabilities and how they can be exploited. Then techniques to create secure systems and defend against such attacks will be discussed. Industry standards for conducting security audits to establish levels of security will be introduced. The course will include an introduction to basic cryptographic techniques as well as hardware used to accelerate cryptographic operations in ATM's and webservers.\"","session":["Fall","Winter"],"prereqs":"ECE344H1 or ECE353H1","coreqs":"None","exclusions":"ECE468H1","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":27.5,"ED":27.5,"Total":55}},{"course":"ENV346H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ESC101H1","title":"Praxis I","description":"\"Engineering Science Praxis I supports the term's course content through design and communication. Students will participate in a weekly design studio, conducting individual and group activities in design, and both oral and written communication.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":20.5,"ES":0,"ED":30.7,"Total":51.2}},{"course":"ESC102H1","title":"Praxis II","description":"\"A studio-based, service learning course in which students work in small teams to identify and then to design solutions for a contemporary issue situated within the Greater Toronto Area. The Design component of the course introduces formal design techniques such as framing, requirements gathering and codification, processes and heuristics, planning, and multi-criteria decision making. The Communication component introduces communicative genres such as Requests for Proposals (RFPs), brochures, posters, and oral presentations. Material from other concurrent courses is integrated through targeted activities and expectations in the Design and Communication components.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":20.5,"ES":0,"ED":30.7,"Total":51.2}},{"course":"ESC103H1","title":"Engineering Mathematics and Computation","description":"\"This course is designed to introduce students to mathematics in an engineering context, while exposing students to computational techniques. Topics include complex numbers, vectors, lines and planes, 3-D visualization, matrices, inverses, solving linear systems, least squares, techniques of numerical integration, associated error analysis, solutions to differential equations. Course content is complemented with the use of MATLAB computational software.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":19.2,"NS":0,"CS":0,"ES":19.2,"ED":0,"Total":38.4}},{"course":"ESC180H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ESC190H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ESC194H1","title":"Calculus I","description":"Topics include: theory and applications of differential and integral calculus, limits, basic theorems and elementary functions. An introduction to differential equations is also included.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":44.8,"NS":0,"CS":0,"ES":0,"ED":0,"Total":44.8}},{"course":"ESC195H1","title":"Ccalculus II","description":"Topics include: techniques of integration, improper integrals, sequences, series, Taylor's theorem, as well as an introduction to vector functions, functions of several variables, partial derivatives and the optimization of multivariable functions.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":44.8,"NS":0,"CS":0,"ES":0,"ED":0,"Total":44.8}},{"course":"ESC203H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ESC204H1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ESC301H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ESC301Y1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ESC384H1","title":"Partial Differential Equations","description":"Introduces analytical techniques for partial differential equations (PDEs). Concepts covered include Fourier series, Sturm-Liouville theory, Green's functions, characteristics, and Laplace transform method. Applications are in model PDEs in continuum mechanics: diffusion, transport, heat, and wave equations.  Prerequisite: MAT290H1 or MAT292H1  Please note:  You can take APM384H1 or ESC384H1 or APM346H1.  They are all mutually exclusive of one another.","session":["Fall"],"prereqs":"MAT290H1","coreqs":"None","exclusions":"APM384H1 OR APM346H1","weight":"","aus":{"Math":44.8,"NS":0,"CS":0,"ES":0,"ED":0,"Total":44.8}},{"course":"ESC401H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ESC470H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ESC471H1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ESC472H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ESC490H1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ESC499H1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ESC499Y1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"FOR308H1","title":"Discovering Wood and its Role in Societal Development","description":"Trees and their components have been used through the centuries for shelter, heat, entertainment, weapons, sport, furnishings, communication, food and medicines.  This course explores the co-evolution of nature and culture by examining the social and economic impacts that the  forest and its exploitation had in the development of societies throughout the ages.  Focus will be on the cultural history of wood and products derived from it and its influence on developing societies from biblical times to modern day. The course will examine how wood's versatility and usefulness in varied applications has been discovered by society as needs for survival to austerity develop. The unique properties of woody materials will be examined to expose its ability to meet the varied demands of societies throughout the ages. This course will allow students to explore the place and role of wood derived products in sustainable society.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":44.8,"ES":0,"ED":0,"Total":44.8}},{"course":"FOR421H1","title":"Green Urban Infrastructure: Sustainable City Forests","description":"With over 80% of the world's population now living in cities, tomorrow's forests will be urban. Increasing global recognition of nature deficit disorder and the values of green infrastructure to mitigate broader human impacts gives a new meaning to the term 'urban forestry', coined here at UofT and now recognized widely. Trees in and around the city are key to providing multiple engineered and ecological services that only recently have been brought into the responsible fiscal planning of every municipality around the globe. If managed properly (a key concept), urban forests mitigate climate change and urban heat island effects, act as carbon sinks, air filters, water purifiers, air conditioners, noise dampeners, wildlife and/or biodiversity refuges, and green spaces for the human spirit. Here, we explore the challenges and opportunities of this exciting new applied field at the cross-roads of ecology, engineering and planning to ensure future global sustainability","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":25.6,"ES":0,"ED":0,"Total":25.6}},{"course":"FOR424H1","title":"Innovation and Manufacturing of Sustainable Materials","description":"Sustainable materials are a mandate for sustainable societies. This course will explore the manufacturing, engineering principles and design fundamentals for creating sustainable materials from renewable resources. Special emphasis will be on bioplastics, biofibre, nanobiofibre, biocomposites and nanobiocomposites. Written communication and design skills will be developed through tutorials and assignments.","session":["Winter"],"prereqs":"APS104H1","coreqs":"None","exclusions":"CHE475H1","weight":"","aus":{"Math":0,"NS":0,"CS":30,"ES":0,"ED":0,"Total":30}},{"course":"FOR425H1","title":"Bioenergy and Biorefinery Technology","description":"Technological advances and approaches in deriving biofuels, chemical feedstocks from forest and other biomass resources. Fundamental chemical attributes of biomass, as they affect the fuel value and potential for deriving liquid, solid and gaseous fuels and valuable chemicals for other applications will be explored.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"FOR410H1","weight":"","aus":{"Math":0,"NS":0,"CS":9.6,"ES":28.8,"ED":0,"Total":38.4}},{"course":"GGR252H1","title":"Marketing Geography","description":"The problem of retail location. The spatial structure of consumer demand and retail facilities. Shopping centres and retail chains. Techniques for site selection and trade area evaluation, location strategies, retail planning.","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":30,"ES":0,"ED":0,"Total":30}},{"course":"HPS210H1","title":"Scientific Revolutions I","description":"Case studies in the history of science from antiquity to 1800, including the revolutionary work of Copernicus, Kepler, Galileo, Descartes, Newton, Linnaeus, Lavoisier, and Herschel. The course is designed to be accessible to science students and non-scientists alike.  Exclusion: HPS200Y1","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":32,"ES":0,"ED":0,"Total":32}},{"course":"HPS280H1","title":"History of Science","description":"An introduction to the history of science, surveying major developments from antiquity to the present.","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":32,"ES":0,"ED":0,"Total":32}},{"course":"HPS283H1","title":"The Engineer in History","description":"\"The emphasis in this course will be more on the history of engineers as workers, members of professional groups, and managers rather than engineering proper, although obviously engineering cannot be ignored when we talk about engineers work.  The aim of the course is to give an understanding of the heritage of engineers as participants in the economy and society.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":32,"ES":0,"ED":0,"Total":32}},{"course":"JRE300H1","title":"Fundamentals of Accounting and Finance","description":"\"This course introduces a brief overview of essential concepts in accounting and corporate finance. The first part of the course covers the fundamentals of accounting. We start by exploring the basic language of accounting and the fundamental concepts of financial reporting. Students learn to read and analyze basic financial statements including the statements of financial position, comprehensive income, changes in equity, and cash flows. We then introduce key management accounting concepts and explore various methods of costing for decision-making. The second part of the course covers the fundamentals of corporate finance.  In the second half, students will learn how to make financial projections and how to value complex investment opportunities.  Following this, students learn various techniques for controlling risk and how to determine the appropriate cost of capital.  Finally, the course considers issues in cash flow management and overviews project valuation as it relates to corporate mergers.\"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":44.8,"ES":0,"ED":0,"Total":44.8}},{"course":"JRE410H1","title":"Markets and Competitive Strategy","description":"\"This course introduces the basic concepts, frameworks and methodologies useful to managers in crafting and executing entrepreneurial business strategies in technology-based companies.  In the first part of the course, students gain an understanding of the external, internal, and dynamic environments of a business and the elements of a superior competitive position.  In the second part, we focus on designing and delivering customer value, which involves strategic decisions about segmentation, targeting and positioning, and tactical decisions related to product introductions, marketing communications, distribution channels and pricing.  In the third part of the course, we build on these fundamentals and examine challenges related to innovation and industry dynamics, such as industry life cycles, disruptive technologies, product renewal, and the relationship between R&D and commercialization.\"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":38.4,"ES":0,"ED":0,"Total":38.4}},{"course":"JRE420H1","title":"People Management and Organizational Behaviour","description":"\"This module spans three inter-related topics: leadership, people management and organization behaviour.  It provides students with both the theory and practice in how to design, lead and manage organizations. Topics include theories of leadership, strategy, ethics, designing organizations for rapid change and differing cultural environments, communication, job design, managing and motivating people, fostering creativity, and team work.  In addition to traditional lectures, exercises and case studies will be used throughout.\"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":44.8,"ES":0,"ED":0,"Total":44.8}},{"course":"MAT185H1","title":"Linear Algebra","description":"\"Linear systems, matrix algebra, Rn as a vector space, a normed space and an inner-product space,linear transformations on Rn, eigenvalues. Applications to circuits, mechanics, etc. Introduction to computer methods.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":44.8,"NS":0,"CS":0,"ES":0,"ED":0,"Total":44.8}},{"course":"MAT186H1","title":"Calculus I","description":"\"Limits, differentiation, maximum and minimum problems, definite and indefinite integrals, application of integration in geometry, mechanics, and other engineering problems.\"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":44.8,"NS":0,"CS":0,"ES":0,"ED":0,"Total":44.8}},{"course":"MAT187H1","title":"Calculus II","description":"\"Techniques of integration, introduction to differential equations, vector differentiation, partial differentiation, series. Application to mechanics and other engineering problems.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":44.8,"NS":0,"CS":0,"ES":0,"ED":0,"Total":44.8}},{"course":"MAT188H1","title":"Linear Algebra","description":"\"Systems of linear equations; matrices; determinants; vectors, lines and planes in 3 dimensions; Rn; vector spaces; eigenvalues and eigenvectors; introduction to products; applications.\"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":44.8,"NS":0,"CS":0,"ES":0,"ED":0,"Total":44.8}},{"course":"MAT196H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MAT231H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MAT234H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MAT290H1","title":"Advanced Engineering Mathematics","description":"\"An introduction to complex variables and ordinary differential equations.  Topics include:  Laplace transforms, ordinary higher-order linear differential equations with constant coefficients; transform methods; complex numbers and the complex plane; complex functions; limits and continuity; derivatives and integrals; analytic functions and the Cauchy-Riemann equations; power series as analytic functions; the logarithmic and exponential functions; Cauchy's integral theorem, Laurent series, residues, Cauchy's integral formula, the Laplace transform as an analytic function.  Examples are drawn from electrical systems.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":50.4,"NS":0,"CS":0,"ES":0,"ED":0,"Total":50.4}},{"course":"MAT291H1","title":"Calculus III","description":"The chain rule for functions of several variables; the gradient. Multiple integrals; change of variables, Jacobians.  Line integrals, independance of path, Green's theorem.  The gradient, divergence and curl of a vector field.  Surface integrals; parametric representations, applications from electromagnetic fields, Gauss' theorem and Stokes' theorem. Maxima and minima, Lagrange multipliers.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":50.4,"NS":0,"CS":0,"ES":0,"ED":0,"Total":50.4}},{"course":"MAT292H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MAT294H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MAT336H1","title":"Elements of Analysis","description":"This course provides the foundations of analysis and rigorous calculus for students who will take subsequent courses where these mathematical concepts are central of applications, but who have only taken courses with limited proofs. Topics include topology of Rn, implicit and inverse function theorems and rigorous integration theory.  Prerequisite: MAT223H1/MAT240H1, MAT235Y1/MAT237Y1 Exclusion: MAT257Y1, MAT337H1 Distribution Requirement: Science Breadth Requirement: The Physical and Mathematical Universes (5)","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"MAT257Y1, MAT337H1","weight":"","aus":{"Math":42,"NS":0,"CS":0,"ES":0,"ED":0,"Total":42}},{"course":"MAT337H1","title":"Introduction to Real Analysis","description":"\"Metric spaces; compactness and connectedness. Sequences and series of functions, power series; modes of convergence. Interchange of limiting processes; differentiation of integrals. Function spaces; Weierstrass approximation; Fourier series. Contraction mappings; existence and uniqueness of solutions of ordinary differential equations. Countability; Cantor set; Hausdorff dimension.\"","session":["Fall","Winter"],"prereqs":"\"MAT224H1, MAT235Y1/MAT237Y1,MAT246H1; NOTE: These Prerequisites will be waived for students who have MAT257Y1\"","coreqs":"None","exclusions":"MAT357H1","weight":"0.5","aus":{"Math":36,"NS":0,"CS":0,"ES":0,"ED":0,"Total":36}},{"course":"MAT357H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MAT389H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE100H1","title":"Dynamics","description":"\"This course on Newtonian mechanics considers the interactions which influence 2-D, curvilinear motion. These interactions are described in terms of the concepts of force, work, momentum and energy. Initially the focus is on the kinematics and kinetics of particles. Then, the kinematics and kinetics of systems of particles and solid bodies are examined. Finally, simple harmonic motion is discussed. The occurrence of dynamic motion in natural systems, such as planetary motion, is emphasized. Applications to engineered systems are also introduced.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":35.8,"CS":0,"ES":15.4,"ED":0,"Total":51.2}},{"course":"MIE191H1","title":"Seminar Course: Introduction to Mechanical and Industrial Engineering","description":"\"This is a seminar series that will preview the core fields in Mechanical and Industrial Engineering.  Each seminar will be given by a professional in one of the major areas in MIE. The format will vary and may include application examples, challenges, case studies, career opportunities, etc. The purpose of the seminar series is to provide first year students with some understanding of the various options within the Department to enable them to make educated choices for second year.  This course will be offered on a credit/no credit basis.  Students who receive no credit for this course must re-take it in their 2S session.  Students who have not received credit for this course at the end of their 2S session will not be permitted to register in session 3F.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.15","aus":{"Math":0,"NS":0,"CS":0,"ES":12.8,"ED":0,"Total":12.8}},{"course":"MIE201H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE210H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE221H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE222H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE230H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE231H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE236H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE237H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE240H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE242H1","title":"Psychology For Engineers","description":"\"Introduction to neuroanatomy and processes that are core to perception, cognition, language, decision making, and action. Use of experiments to test hypotheses concerning brain activities and computations. Conducting and reporting experimental research, including confidence intervals, P-Values, correlation, and satisfaction of research ethics requirements.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":57.6,"CS":0,"ES":0,"ED":0,"Total":57.6}},{"course":"MIE243H1","title":"Mechanical Engineering Design","description":"Introduction to basic mechanical parts and mechanisms: gears, cams, bearings, linkages, actuators and motors, chain and belt drives, brakes and clutches, hydraulics and pneumatics. Tutorials on engineering drawing, sketching, and CAD/CAM in SolidWorks: views and drawing types, 2D sketching, 3D modeling and engineering drawing generation, modeling of assembly and motion analysis/animation. Conceptual design examples and mechanical engineering design process, including selection and applications of mechanisms. Dissection and reverse engineering of selected mechanical devices, mechanisms, and subsystems. Competitive group design project including technical report and 3D printing.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":32,"ED":32,"Total":64}},{"course":"MIE250H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE253H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE258H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE262H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE263H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE270H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE297H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE301H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE303H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE304H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE311H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE312H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE313H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE315H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE320H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE334H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE335H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE341H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE342H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE343H1","title":"Industrial Ergonomics and the Workplace","description":"\"The Biology of Work: anatomical and physiological factors underlying the design of equipment and work places. Biomechanical factors governing physical workload and motor performance. Circadian rhythms and shift work. Measurement and specification of heat, light, and sound with respect to design of the work environment.\" Prerequisite: MIE231H1 F/MIE236H1 F or equivalent (ECE302H1)","session":["Fall"],"prereqs":"MIE231H1 or MIE236H1 or ECE302H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":28.8,"CS":0,"ES":28.8,"ED":0,"Total":57.6}},{"course":"MIE344H1","title":"Ergonomic Design of Information Systems","description":"\"The goal of this course is to provide an understanding of how humans and machines can be integrated with information systems. The focus will be on the design of human-machine interfaces, and on the analysis of the impact of computers on people. The course will also include coverage of usability engineering and rapid prototyping design, analysis of user mental models and their compatibility with design models, and quantitative modelling of human-computer interaction.\"","session":["Fall"],"prereqs":"MIE240H1 S or permission of the instructor","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":34.6,"ED":23,"Total":57.6}},{"course":"MIE345H1","title":"Case Studies in Ergonomics","description":"A detailed analysis will be made of several cases in which human factors methods have been applied to improve the efficiency with which human-machine systems operate. Examples will be chosen both from the area of basic ergonomics and from high technology. Emphasis will be placed on the practical use of material learned in earlier human factors courses.","session":["Winter"],"prereqs":"MIE240H1 S","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":96,"ED":64,"Total":160}},{"course":"MIE346H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE350H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE354H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE360H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE363H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE364H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE365H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE366H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE367H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE368H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE369H1","title":"Introduction to Artificial Intelligence","description":"Introduction to Artificial Intelligence. Search. Constraint Satisfaction. Propositional and First-order Logic Knowledge Representation. Representing Uncertainty (Bayesian networks). Rationality and (Sequential) Decision Making under Uncertainty. Reinforcement Learning. Weak and Strong AI, AI as Engineering, Ethics and Safety in AI.","session":["Winter"],"prereqs":"ECE244H1 and ECE345H1 and ECE302H1","coreqs":"None","exclusions":"ROB311H1 and CSC384H1","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":38.4,"ED":12.8,"Total":51.2}},{"course":"MIE375H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE376H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE377H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE397Y1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE402H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE404H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE407H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE408H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE414H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE422H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE424H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE429H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE433H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE438H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE439H1","title":"Biomechanics I","description":"\"Introduction to the application of the principles of mechanical engineering - principally solid mechanics, fluid mechanics, and dynamics - to living systems. Topics include cellular mechanics, blood rheology, circulatory mechanics, respiratory mechanics, skeletal mechanics, and locomotion. Applications of these topics to biomimetic and biomechanical design are emphasized through case studies and a major, integrative group project.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":12.8,"CS":0,"ES":12.8,"ED":25.6,"Total":51.2}},{"course":"MIE440H1","title":"* Design of Innovative Products","description":"Recently developed methods applied at different stages of the design process include: Identification of unmet/underserved user needs through a modified definition of lead users (those who experience needs in advance of the mainstream population) including identifying/studying lead users, identifying which lead-user needs are relevant to the general population; Roles of function and affordance in successful products; Obstacles of fixation and cognitive bias to creativity; Concept generation methods including TRIZ/TIPS (Theory of Inventive Problem Solving, use of unrelated stimuli and analogy (e.g., from biology); Configuration design methods including design for transformation, design for assembly and end-of-life, e.g., reuse, repair and recycling. Hands-on experience of these topics in lectures, tutorials, and labs support successful application of the methods for the course project, as well as future design activities.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":22.4,"ED":22.4,"Total":44.8}},{"course":"MIE441H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE442H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE443H1","title":"* Mechatronics Systems:  Design and Integration","description":"The course aims to raise practical design awareness, provide pertinent project engineering methodology, and generate a know-how core in integration of complex automation. This course has mainly practical content, and is integral and useful in the training and education of those students who plan to be employed in areas related to intelligent automation, as well as to the breadth of knowledge of all others. Although emphasis will be on robotic-based automation (mechatronics), the learning will be useful in all domains of system integration. This course will introduce students to the basics of integration, methodology of design, tools, and team project work. The course will be monitored based on projects from a selected list of topics. The lectures will be in format of tutorials as preparation and discussions on project related issues. A main goal is to bring the methods, means and spirit of the industrial design world to the class room. Emphasis will be on understanding the elements of integration, methodology and approaches, and will involve numerous case studies. Specifically the course will provide a practical step-by-step approach to integration: specifications, conceptual design, analysis, modeling, synthesis, simulation and bread-boarding, prototyping, integration, verification, installation and testing. Issues of project management, market, and economics will be addressed as well.  Limited Enrolment.","session":["Winter"],"prereqs":"MIE346H1 or (ECE331H1 and ECE334H1)","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":17.3,"ED":40.3,"Total":57.6}},{"course":"MIE444H1","title":"Mechatronics Principles","description":"This course provides students with the tools to design, model, analyze and control mechatronic systems (e.g. smart systems comprising electronic, mechanical, fluid and thermal components). This is done through the synergic combination of tools from mechanical and electrical engineering, computer science and information technology to design systems with built-in intelligence. The class provides techniques for the modeling of various system components into a unified approach and tools for the simulation of the performance of these systems. The class also presents the procedures and an analysis of the various components needed to design and control a mechatronic system including sensing, actuating, and I/O interfacing components.  ***PREREQUISITE: MIE342H1, MIE346H1","session":["Fall"],"prereqs":"ECE110H1 and ECE231H1","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":17.9,"ED":26.9,"Total":44.8}},{"course":"MIE448H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE451H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE457H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE458H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE459H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE463H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE464H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE465H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE468H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE469H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE479H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE488H1","title":"Entrepreneurship and Business for Engineers","description":"\"A complete introduction to small business formation, management and wealth creation.  Topics include: the nature of the Entrepreneur and the Canadian business environment; business idea search and Business Plan construction; Buying a business, franchising, taking over a family business; Market research and sources of data; Marketing strategies promotion, pricing, advertising, electronic channels and costing;  The sales process and management, distribution channels and global marketing; Accounting, financing and analysis, sources of funding, and financial controls; The people dimension: management styles, recruiting and hiring, legal issues in employment and Human Resources; Legal forms of organization and business formation, taxation, intellectual property protection; the e-Business world and how businesses participate; Managing the business: location and equipping the business, suppliers and purchasing, credit, ethical dealing; Exiting the business and succession, selling out.  A full Business Plan will be developed by each student and the top submissions will be entered into a Business Plan competition with significant cash prices for the winners.  Examples will be drawn from real business situations including practicing entrepreneurs making presentations and class visits during the term. (Identical courses are offered: ECE488H1F, MSE488H1F, CHE488H1S and CIV488H1S.) \"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"APS234 and APS432","weight":"0.5","aus":{"Math":0,"NS":0,"CS":51.2,"ES":0,"ED":0,"Total":51.2}},{"course":"MIE490Y1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE491Y1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE498H1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE498Y1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE504H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE505H1","title":"Micro/Nano Robotics","description":"This course will cover the design, modeling, fabrication, and control of miniature robot and micro/nano-manipulation systems for graduate and upper level undergraduate students. Micro and Nano robotics is an interdisciplinary field which draws on aspects of microfabrication, robotics, medicine and materials science.   In addition to basic background material, the course includes case studies of current micro/nano-systems, challenges and future trends, and potential applications.  The course will focus on a team design project involving novel theoretical and/or experimental concepts for micro/nano-robotic systems with a team of students.  Throughout the course, discussions and lab tours will be organized on selected topics.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":43.2,"ED":14.4,"Total":57.6}},{"course":"MIE506H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE507H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE510H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE515H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE516H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE517H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE519H1","title":"* Advanced Manufacturing Technologies","description":"This course is designed to provide an integrated multidisciplinary approach to Advanced Manufacturing Engineering, and provide a strong foundation including fundamentals and applications of advanced manufacturing AM. Topics include: additive manufacturing, 3D printing, micro and nanomanufacturing, intelligent manufacturing, Advanced Materials, lean manufacturing, AM in machine design and product development, process control technologies. New applications of AM in sectors such as automotive, aerospace, biomedical, electronic, food processing.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":19.2,"ED":19.2,"Total":38.4}},{"course":"MIE520H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE523H1","title":"Engineering Psychology and Human Performance","description":"An examination of the relation between behavioural science and the design of human-machine systems, with special attention to advanced control room design. Human limitations on perception, attention, memory and decision making, and the design of displays and intelligent machines to supplement them. The human operator in process control and the supervisory control of automated and robotic systems. Laboratory exercises to introduce techniques of evaluating human performance. PREREQUISITE: MIE231H1/MIE236H1/STA286H1 or equivalent required; MIE237H1 or equivalent recommended","session":["Fall"],"prereqs":"MIE231H1/MIE236H1/STA286H1 or equivalent required","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":43.2,"ED":14.4,"Total":57.6}},{"course":"MIE540H1","title":"Product Design","description":"\"This course takes a 360 perspective on product design: beginning at the market need, evolving this need into a concept, and optimizing the concept. Students will gain an understanding of the steps involved and the tools utilized in developing new products. The course will integrate both business and engineering concepts seamlessly through examples, case studies and a final project. Some of the business concepts covered include: identifying customer needs, project management and the economics of product design. The engineering design tools include: developing product specifications, concept generation, concept selection, FAST diagrams, orthogonal arrays, full and fractional factorials, noises, interactions, tolerance analysis and latitude studies. Specific emphasis will be placed on robust and tunable technology for product optimization and generating product families. Critical Parameters will be developed using the Voice of the Customer (VOC), FAST diagrams and a House of Quality (HOQ).\"","session":["Winter"],"prereqs":"MIE231H1 F/MIE236H1 F or equivalent.","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":22.4,"ED":22.4,"Total":44.8}},{"course":"MIE542H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE550H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE561H1","title":"Healthcare Systems","description":"\"MIE 561 is a cap-stone course. Its purpose is to give students an opportunity to integrate the Industrial Engineering tools learned in previous courses by applying them to real world problems. While the specific focus of the case studies used to illustrate the application of Industrial Engineering will be the Canadian health care system, the approach to problem solving adopted in this course will be applicable to any setting. This course will provide a framework for identifying and resolving problems in a complex, unstructured decision-making environment. It will give students the opportunity to apply a problem identification framework through real world case studies. The case studies will involve people from the health care industry bringing current practical problems to the class. Students work in small groups preparing a feasibility study discussing potential approaches. Although the course is directed at Industrial Engineering fourth year and graduate students, it does not assume specific previous knowledge, and the course is open to students in other disciplines.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":25.6,"ED":25.6,"Total":51.2}},{"course":"MIE562H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE563H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIE566H1","title":"Decision Analysis","description":"IV-AEESCBASEF, IV-AEINDBASC 3/-/2/0.50 The purpose of this course is to provide a working knowledge of methods of analysis of problem and of decision making in the face of uncertainty. Topics include decision trees, subjective probability assessment, multiattribute utility approaches, goal programming, Analytic Hierarchy Process and the psychology of decision making. Prerequisite: MIE231H1 / MIE236H1 or equivalent","session":["Fall"],"prereqs":"MIE231H1 / MIE236H1 or equivalent","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":51.2,"ED":0,"Total":51.2}},{"course":"MIE567H1","title":"Dynamic & Distributed Decision Making","description":"Fundamental concepts and mathematical frameworks for scientific sequential decision making in the presence of uncertainty. Utility theory, uncertainty modeling, theory of games, dynamic programming, and multi-agent system. Discussion of how the decision theories can be applied to design algorithms and processes for real-world cases.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":12.8,"NS":0,"CS":0,"ES":25.6,"ED":12.8,"Total":51.2}},{"course":"MIN120H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN191H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN225H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN250H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN301H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN320H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN329H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN330H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN351H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN400H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN401H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN430H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN450H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN466H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN467H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN470H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN511H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN540H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MIN565H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE120H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE160H1","title":"Molecules and Materials","description":"\"This course will cover both the fundamentals and applications of molecular chemistry as it relates to the properties of materials. Fundamental topics will include: (1) the design of chemical structures and their relationship to optical and electronic properties; (2) the chemistry and physics of covalent and non-covalent bonding; (3) the relationship of atomic bonding to molecular geometry and local symmetry; (4) crystal structures of extended solids; and (5) extension of these principles to electronic structure, elasticity, and vector and tensor descriptions of materials properties. Applications to diverse areas of engineering will be discussed.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"MSE260H1","weight":"0.5","aus":{"Math":0,"NS":33.6,"CS":0,"ES":11.2,"ED":0,"Total":44.8}},{"course":"MSE191H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE202H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE217H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE218H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE219H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE222H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE235H1","title":"Materials Physics","description":"\"Application of solid state physics to describe properties of materials. Thermal properties of solids: lattice vibrations (phonons), heat capacity, thermal conductivity. Electrical properties of metals: simple circuits, resistivity of metals (classical and quantum descriptions), Seebeck, Peltier, and Thomson effects. Electrical properties of semiconductors: band structure and occupancy, conductivity, Hall effect, simple devices. Electrical properties of insulators: polarization, capacitance, optical properties, ferroelectric and piezoelectric materials. Magnetic properties: diamagnetism and paramagnetism, ferromagnetic and ferrimagnetic materials, magnetic domains, B-H curves.\"","session":[],"prereqs":"None","coreqs":"None","exclusions":"PHY335H1 or ECE330H1 or ECE335H1","weight":"0.5","aus":{"Math":0,"NS":36.4,"CS":0,"ES":9.1,"ED":0,"Total":45.5}},{"course":"MSE238H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE244H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE245H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE250H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE270H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE296H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE297H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE298H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE301H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE302H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE316H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE332H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE335H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE342H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE343H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE351H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE355H1","title":"Materials Processing and Sustainable Development","description":"Materials processing requires the use of raw materials and energy resources.  Various materials processing methods are analyzed in terms of efficient use of raw materials and energy.  The treatment and discharge of effluent streams in an environmentally sound manner are discussed.  An introduction to life cycle analysis is also given.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.25","aus":{"Math":0,"NS":0,"CS":0,"ES":44.8,"ED":0,"Total":44.8}},{"course":"MSE390H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE398Y1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE401H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE403H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE415H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE419H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE421H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE430H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE431H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE435H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE437H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE438H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE440H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE443H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE450H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE451H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE455H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE458H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE459H1","title":"Synthesis of Nanostructured Materials","description":"\"Various synthesis techniques to produce nanostructured materials will be introduced. These include methods involving the vapor phase (physical and chemical vapor deposition, organometallic chemical vapor deposition), the liquid phase (rapid solidification, spark erosion), the solid phase, (mechanical attrition, equal channel deformation) as well techniques producing these structures from solution (electrodeposition, electroless processing, precipitation). Secondary processing techniques to produce final products or devices will also be discussed.\"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":0,"ES":128,"ED":32,"Total":160}},{"course":"MSE461H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE462H1","title":"Materials Physics II","description":"Electron quantum wave theory of solid-state materials will be introduced. Quantum phenomena in various materials systems, in particular nano materials, will be discussed. Electronic properties of materials such as charge transport, dielectric properties, optical properties, magnetic properties, and thermal properties will be discussed using appropriate quantum theory. Materials systems to be studied may include metals, semiconductors, organics, polymers, and insulators.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":16,"CS":0,"ES":16,"ED":0,"Total":32}},{"course":"MSE478H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE488H1","title":"Entrepreneurship and Business for Engineers","description":"\"A complete introduction to small business formation, management and wealth creation. Topics include: the nature of the Entrepreneur and the Canadian business environment; business idea search and Business Plan construction; Buying a business, franchising, taking over a family business; Market research and sources of data; Marketing strategies promotion, pricing, advertising, electronic channels and costing; The sales process and management, distribution channels and global marketing; Accounting, financing and analysis, sources of funding, and financial controls; The people dimension: management styles, recruiting and hiring, legal issues in employment and Human Resources; Legal forms of organization and business formation, taxation, intellectual property protection; the e-Business world and how businesses participate; Managing the business: location and equipping the business, suppliers and purchasing, credit, ethical dealing; Exiting the business and succession, selling out. A full Business Plan will be developed by each student and the top submissions will be entered into a Business Plan competition with significant cash prizes for the winners. Examples will be drawn from real business situations including practicing entrepreneurs making presentations and class visits during the term. (Identical courses are offered: ECE488H1F, MIE488H1F, CHE488H1S and CIV488H1S.)\"","session":[],"prereqs":"None","coreqs":"None","exclusions":"APS234 and APS432","weight":"0.5","aus":{"Math":0,"NS":0,"CS":51.2,"ES":0,"ED":0,"Total":51.2}},{"course":"MSE490H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE492H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE493H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE498Y1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE550H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"MSE558H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"PHY180H1","title":"Classical Mechanics","description":"\"Mechanics forms the basic background for the understanding of physics. This course on Classical, or Newtonian mechanics, considers the interactions which influence motion. These interactions are described in terms of the concepts of force, momentum and energy. Initially the focus is on the mechanics of a single particle, considering its motion in a particular frame of reference, and transformations between reference frames. Then the dynamics of systems of particles is examined. Textbook: Physics for Scientists and Engineers vol. 1. 6th ed. by Serway and Jewett.\"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":43.5,"CS":0,"ES":10.9,"ED":0,"Total":54.4}},{"course":"PHY293H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"PHY294H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"PHY327H1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"PHY427H1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ROB301H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ROB310H1","title":"Mathematics for Robotics","description":"The course addresses advanced mathematical concepts particularly relevant for robotics. The mathematical tools covered in this course are fundamental for understanding, analyzing, and designing robotics algorithms that solve tasks such as robot path planning, robot vision, robot control and robot learning. Topics include complex analysis, optimization techniques, signals and filtering, advanced probability theory, and numerical methods. Concepts will be studied in a mathematically rigorous way but will be motivated with robotics examples throughout the course.","session":["Fall"],"prereqs":"MAT188H1 and MAT290H1","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":31.4,"NS":0,"CS":0,"ES":13.4,"ED":0,"Total":44.8}},{"course":"ROB311H1","title":"Artificial Intelligence","description":"An introduction to the fundamental principles of artificial intelligence from a mathematical perspective. The course will trace the historical development of AI and describe key results in the field. Topics include the philosophy of AI, search methods in problem solving, knowledge representation and reasoning, logic, planning, and learning paradigms. A portion of the course will focus on ethical AI, embodied AI, and on the quest for artificial general intelligence.","session":["Winter"],"prereqs":"ECE302H1 and ECE345H1","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":0,"ES":44.8,"ED":0,"Total":44.8}},{"course":"ROB313H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ROB498H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ROB501H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"ROB521H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"RSM430H1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"RSM432H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"RSM434H1","title":"Financial Trading Strategies","description":"Previous Course Number RSM412H1  This course will use finance theory applied with Excel applications to understand potential returns and risks inherent in particular investment/trading strategies. Learning-by-doing will be facilitated by simulation-based Rotman Interactive Trader cases focused on particular risks. This training will be analogous to using a flight simulator for learning to fly. Not eligible for CR/NCR option. Contact Rotman Commerce for details.  Prerequisite RSM332H1 Exclusion RSM412H1 Financial Trading Strategies Distribution Requirements Social Science Breadth Requirements The Physical and Mathematical Universes (5)","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":30,"ES":0,"ED":0,"Total":30}},{"course":"STA286H1","title":"","description":"","session":[],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"STA302H1","title":"","description":"","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"STA347H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"STA410H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"STA447H1","title":"","description":"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"TEP234H1","title":"Entrepreneurship and small business","description":"Part 1 of the 2 Part Entrepreneurship Program The age of enterprise has arrived. Strategic use of technology in all sorts of businesses makes the difference between success and failure for these firms. Wealth creation is a real option for many and the business atmosphere is ready for you! Increasingly, people are seeing the advantages of doing their own thing, in their own way, in their own time. Entrepreneurs can control their own lives, structure their own progress and be accountable for their own success - they can fail, but they can not be fired! After all, engineers are the most capable people to be in the forefront of this drive to the business life of the next century. This course is the first of a series of two dealing with entrepreneurship and management of a small company. It is intended that the student would continue to take the follow up course APS432 as s/he progresses toward the engineering degree. Therefore, it is advisable that the descriptions of both courses be studied prior to deciding to take this one. This is a limited enrolment course. If the number of students electing to take the course exceeds the class size limit, selection of the final group will be made on the basis of the \"Entrepreneur's Test\". There will be a certificate awarded upon the successful completion of both courses attesting to the fact that the student has passed this Entrepreneurial Course Series at the University of Toronto. The course is based on real life issues, not theoretical developments or untried options. Topics covered include: Who is an entrepreneur; Canadian business environment; Acquisitions; Different business types (retail, wholesale, manufacturing, and services); Franchising; Human resources, Leadership, Business law; and many others. Several visitors are invited to provide the student with the opportunity to meet real entrepreneurs. There will be several assignments and a session project. It should be noted that the 5 hours per week would all be used for whatever is needed at the time, so tutorials will not normally happen as the calendar indicates them. Exclusion: CHE488H1/CIV488H1/ECE488H1/MIE488H1/MSE488H1/APS281H1","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"CHE488H1/CIV488H1/ECE488H1/MIE488H1/MSE488H1/APS281H1","weight":"","aus":{"Math":0,"NS":0,"CS":57.6,"ES":0,"ED":0,"Total":57.6}},{"course":"TEP281H1","title":"Language and Meaning (Formerly APS281H1)","description":"As students study how language is used to make meaning in diverse contexts they will hone their own skills in deploying written and oral professional engineering language. The course explores the nature of language across linguistic, discipline and cultural boundaries and students apply the theoretical knowledge of language and language learning to their own written and oral language performances. In conjunction with this, theories of translation and bilingualism will be introduced to challenge assumptions about the universality of meanings. Weekly lecture and tutorial. Registration is by permission of the Department.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":51.2,"ES":0,"ED":0,"Total":51.2}},{"course":"TEP320H1","title":"","description":"","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":null,"NS":null,"CS":null,"ES":null,"ED":null,"Total":0}},{"course":"TEP321H1","title":"Representing Science and Technology in Popular Media (Formerly APS321H1)","description":"\"Humanities and Social Science ElectiveAnalytical approach to writing and style; representations of current scientific research and developments in technology in the popular media; books by scientists aimed at non technical readers, reporting (including new media) on developments in science and technology. Rhetorical strategies for delivering technical information to non technical readers, inlcuding misrepresentations, analogy and metaphor. Focus on the popular media's (mis)representations of climate science, nanotechnology, and bioengineering.\"","session":["Winter"],"prereqs":"CHE397H1 or ECE297H1 or ECE299H1 or ESC201H1 or MSE390H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":38.4,"ES":0,"ED":0,"Total":38.4}},{"course":"TEP322H1","title":"Language and Power (Formerly APS322H1)","description":"\"Humanities and Social Science ElectiveAnalytical approach to writing and style. Study of persuasion in political, scientific and ethical contexts. Development of critical thinking skills. History of rhetoric viewing major contributors in context: Aristotle, Cicero, Medieval rhetoric, modern rhetoricians. Analysis of major scientific and political writing and speech.\"","session":[],"prereqs":"CHE397H1 or ECE297H1 or ECE299H1 or ESC201H1 or MSE390H1","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":38.4,"ES":0,"ED":0,"Total":38.4}},{"course":"TEP324H1","title":"Engineering and Social Justice (Formerly APS324H1)","description":"This course explores the relationship between engineering and the concepts of social justice to develop the skills needed to take practical action in a complex world. It develops personal responses to ideas of justice, bias and marginalization as these affect Engineers and Engineering in general, domestically as well as globally, in projects as well as in contexts such as the workplace and academic environment. Readings will be drawn from current writers on Engineering and Social Justice and students will rehearse action through theatre techniques developed to enable communities to practice and critique action.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":38.4,"ES":0,"ED":0,"Total":38.4}},{"course":"TEP325H1","title":"Engineering and Science in the Arts (Formerly APS325H1)","description":"This course examines the connections between engineers, scientists, and artists. Taking examples from architecture, sculpture, painting, and the performing arts, this course will show how these artistic disciplines have grown through their interplay with engineering and science.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":38.4,"ES":0,"ED":0,"Total":38.4}},{"course":"TEP326H1","title":"Special Topics in Creative Writing  (Formerly APS326H1)","description":"In this course, students will explore the creative writing process, with an emphasis on the giving and receiving of critical feedback. This exploration will reinforce the iterative principles of the engineering design process and will provide students with flexible and transferable tools for them to apply to future engineering work. They will examine up to two genres of creative writing (fiction, science fiction, poetry, creative non-fiction, screenwriting, playwriting, etc.) in order to hone their own creative and critical thinking skills. Students will be introduced to relevant elements of craft, will analyze representative literary examples, will create original creative work both in generative weekly exercises and in longer at-home assignments, will give and receive feedback from their peers through structured in-class workshops, and will apply this feedback to their own writing.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":38.4,"ES":0,"ED":0,"Total":38.4}},{"course":"TEP327H1","title":"Engineering and Law (Formerly APS327H1)","description":"Upon graduating university and entering the workforce, engineering students have little idea about how frequently in their professional lives their interactions, decisions, and actions will touch on various areas of law. This course is designed to highlight the amount of overlap between these two pillars in todays society. From acting as an expert witness, to preparing a patent, to creating a contract for supplies and beyond. By the end of this course, students will have a working understanding of the intersection between Engineering and Law, and be able to navigate themselves in that area.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":38.4,"ES":0,"ED":0,"Total":38.4}},{"course":"TEP343H1","title":"Foundations of Engineering Leadership (Formerly APS343H1)","description":"This course is a practical approach to being a more productive engineer based on the premise that for technology to become a reality it must be translated through people.  A key is to understand that engineers lead in ways that reflect their skills and mind set.  The course begins with examining: 1) the meaning of leading (Why do something?); 2) the processes of leading (How do you do you create a vision and motivate others?); and 3) the tools of leading (What steps do you take to lead?).  Learning frameworks and personal working styles inventories provide practical tools to assist the student to understand human nature and the logic of learning to become a competent leader of self, teams and organizations.  The student prepares to become a competent leader by undertaking to learn (understand and integrate) key skills, character attributes and purposeful behaviours.  The course presents strategies for development of high performance teams.  Special attention is given to a number of subjects: transformational change, organizational culture, high performance work systems, and self-leadership.  The course material is delivered through lectures, readings, in-class discussion and a team project.  The project is based on the team interviewing the CEO of an engineering-intensive company or senior leader in the community.  Students will be required to submit written reflections on course content and their personal experience.","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":25.6,"ES":0,"ED":0,"Total":25.6}},{"course":"TEP432H1","title":"Entrepreneurship and Business Management (Formerly APS432H1)","description":"\"Part 2 of the 2 Part Entrepreneurship ProgramThis is part two of the Entrepreneurship course series. The student considering taking this course would typically plan to pursue a career in small business started by him/herself, or in a family enterprise. The skills acquired, however, are very useful in any business where a graduate might end up in his/her career, without the need for actually being an entrepreneur. Our approach to teaching is based on real-life business experiences and many years of successful practice of \"what we preach\". The course contains very little theoretical work or academic approaches. It is designed to familiarise you with the kinds of opportunities (problems) likely to be encountered in an entrepreneurial career. If you really want this lifestyle and are prepared to work hard, we will provide you with the practical knowledge and technical skills required to pursue this kind of career. Topics covered in this course include: Marketing and Sales; Legal issues; Financing the business; Human Resources challenges, the Business Plan and many other issues. Note that the course material may be adjusted between the two courses as required. We recognize the value of communication skills in both the classroom and in project reports. In fact, we require that you learn how to present yourself in a business-like manner. As and when appropriate, outside visitors from the business community will join in and contribute to the class discussions. The course deals with practical concepts, actual past and current events and is presented from the point of view of someone who has \"done it all\". This means that what you hear is the real stuff. There will be several assignments and the preparation of a full Business Plan as the session project. It should be noted that the 5 hours per week would all be used for whatever is needed at the time, so tutorials will not normally happen as the calendar indicates them.\"","session":["Winter"],"prereqs":"TEP234H1","coreqs":"None","exclusions":"CHE488H1/CIV488H1/ECE488H1/MIE488H1/MSE488H1","weight":"0.5","aus":{"Math":0,"NS":0,"CS":57.6,"ES":0,"ED":0,"Total":57.6}},{"course":"TEP442H1","title":"Cognitive and Psychological Foundations of Effective Leadership (Formerly APS442H1)","description":"\"This course investigates the cognitive and psychological foundations of effective leadership. Students will explore current theories driving effective leadership practice including models of leadership, neurophysiological correlates of leadership and psychodynamic approaches to leadership. Students will learn and apply skills including mental modeling, decision-making, teamwork and self-evaluation techniques. This course is aimed at helping Engineering students to gain practical skills that will enhance their impact as leaders throughout their careers.\"","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"0.5","aus":{"Math":0,"NS":0,"CS":38.4,"ES":0,"ED":0,"Total":38.4}},{"course":"TEP444H1","title":"Positive Psychology for Engineers (Formerly APS444H1)","description":"Many disciplines have explored happiness - philosophy, anthropology, psychology, sociology, neurobiology, film, art and literature - to name a few. Why not engineering? During the first part of the course we will play catch-up, examining the scholarly and creative ways that people have attempted to understand what makes for a happy life. Then we turn our attention to our own domain-expertise, applying engineering concepts like \"balance\", \"flow\", \"amplitude\", \"dynamic equilibrium\"\"momentum\" and others to explore the ways that your technical knowledge can contribute to a deep understanding of happiness. This course is designed to challenge you academically as we analyze texts from a variety of disciplines, but it is also designed to challenge you personally to explore happiness as it relates to yourself, your own personal development and your success and fulfillment as an engineer.","session":["Fall"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":38.4,"ES":0,"ED":0,"Total":38.4}},{"course":"TEP445H1","title":"The Power of Story: Discovering Your Leadership Narrative (Formerly APS445H1)","description":"This course offers an introduction to relational, authentic and transformational leadership theory by focusing on narrative and the power of story telling. Students will practice story-telling techniques by learning about the mechanics of stories, improve their public speaking by engaging in regular storytelling practice, explore their personal history by reflecting on their identities, and develop critical thinking skills regarding the stories (meta-narratives) that surround us, particularly as they relate to engineering problems/ethics. This is a highly experiential course with a focus on reading, discussion, practice and reflection.","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":32,"ES":0,"ED":0,"Total":32}},{"course":"TEP447H1","title":"The Art of Ethical & Equitable Decision Making in Engineering (Formerly APS447H1)","description":"The primary objective of this course is to help engineering students navigate the ambiguous world of engineering ethics and equity using case studies drawn from the careers of Canadian engineers. In addition to being exposed to a range of ethical theories, the PEO code of ethics and the legal context of engineering ethics, students enrolled in this course will engage in ethical decision-making on a weekly basis.","session":["Fall","Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":38.4,"ES":0,"ED":0,"Total":38.4}},{"course":"TEP448H1","title":"System Mapping","description":"System mapping is a system thinking tool that is frequently used in fields such as public health and environmental policy to describe complex, multi-stakeholder problems. Students will apply system mapping techniques to describe complex problems with techical, social and environmental aspects. Students will explore fields outside of engineering that are critical to these challenges, including public policy, sociology, and law. Students will complete a team project to develop a system map of a complex problem. The emphasis will be on problem definition not problem solution, though it is expected that maps will point to potential paths for solution.","session":["Winter"],"prereqs":"None","coreqs":"None","exclusions":"None","weight":"","aus":{"Math":0,"NS":0,"CS":38.4,"ES":0,"ED":0,"Total":38.4}}]}